[
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Most everything about this neat little movie has been said by previous posters, except this.", "The motivation for making it was, of all things, the US State Department! The US was deeply involved in fighting World War Two. At this point in time the average American knew almost NOTHING about South America, and the Nazi government was busy making business and political connections there, especially in Paraguay... there, transplanted Germans were a well established colony. They were aiding Hitler's war effort with the operation of industrial concerns, as well as providing espionage support.", "South America promised to become a new battlefront if German successes and infiltration continued. The region produced vital strategic raw materials, key among them rubber.", "Our strongest ally in the region was Brazil. The US Navy had a number of installations there, both sea and air. The Brazilian Navy worked closely with US forces in hunting U-boats in the Atlantic narrows; a number of US Navy vessels were transferred to them. American air bases (the largest of which was at Recife) provides home base for American aircraft, both fixed wing and lighter than air blimps, to provide air support coverage to trans Atlantic convoy operations.", "The State department felt it would be a good idea to familiarize Americans with the land, people, and way of life of South America, and called on Disney to produce THE THREE CABALLEROS. The movie was, first and foremost, a TEACHING TOOL for both military forces and the general public during a global war.", "BTW... I love the crazy little bird too! HE'S the best part of the film!", "There are two other Disney films made for the Government that I'd LOVE to find copies of.", "One is VICTORY THROUGH AIR POWER, another WW2 product.", "The other is one that I saw back in Basic Training in the 1970s. Believe it or not, the Walt Disney studios produced a military training film on the prevention of VENEREAL DISEASE!!! The unfortunate Lady dispensing said commodity bore a VERY striking resemblance to Snow White! ", "Because of that film I can never view SNOW WHITE in quite the same way ever again!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros is a lot of fun, using a mix of live action and animation to bring Brazil and Mexico alive to birthday boy Donald Duck. As he's joined by Panchito and José he realises what he has been missing all these years, falls in love with Aurora Miranda (sister of Carmen), learns to dance, and much more.", "With eye-poppingly beautiful animation and lovely colours, it is no surprise that that was the one cartoon Disney veteran Ward Kimball claimed he was truly proud of. The idea of the three birds as international musketeers living the good life is inspired and the running time is just about right."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["It was a cold January Saturday evening. The park was beautifully lit. People were cheery. We could see the Matterhorn on our right hand side. Magical is the best description I could find.", "Suddenly, I started singing...", "\"Somos los tres carros, los Tres Caballeros, y nadie es igual a nosotros...\"", "What do I know. My friends all knew the words. 4 guys, ranging from 27 to 31 years old, began forming a chrous line and singing off the top of our lungs...", "I don't know how this happened. This is not, by any stretch of imagination, a popular or wildly succesful film. I guess it just touched us, the way Donald Duck had a mexican friend (Panchito), or the wild \"Piñata\" scene, or the strong latin flavour of the film.", "Memories notwithstanding, we kept on singing... and singing... and singing.", "People around us seemed to enjoy the show, too.", "\"Valientes brillamos, como brilla un peso", "-Quien dice?!?", "NOSOTROS, LOS TRES CABALLEROS!\""]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Wildly colorful, almost hallucinogenic offering from Walt Disney plays like \"Fantasia\" on speed. Though not much more than a hodgepodge of story ideas, the film mixes live-action with animation in saluting Mexican and South American cultures. Donald Duck is the star this time, and his title musical number alongside Joe Carioca and Panchito is a head-swirling collage of colors. The Disney animators were obviously full of inspiration, but the entire movie plays like that drunken elephant sequence from \"Dumbo\": manic, fruity, sometimes quite fabulous. Entertaining to be sure, and better than its predecessor \"Saludos Amigos\", but certainly odd and never very popular from the 1940s through the 1960s since Disney rarely circulated it as a whole. *** from ****"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This was my favorite movie when I was four.  Now that I'm older, I still watch it every once in awhile, even though there are movies I like better. The Three Caballeros is full of cute humor early in the movie, and the rapport between Donald Duck and Joe Carioca is wonderful.  The animated short `The Cold-Blooded Penguin' is *very* cute, and the song `Baia' is one of my favorite Disney songs of all time.  Then Panchito arrives, and after the wonderful `Three Caballeros' song, things start to go a little bit crazy.  The plot, such as it was, completely evaporates as Donald seems to descend into a girl-crazy madness.  I'm not saying this is necessarily a bad thing, however; the final part of the movie is very entertaining, even though it's odd at the same time.  I gave this movie an 8 out of 10."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Yippie-ey-ya! This has got to be one of Disney most best ever short story movies! Not only is it educational but it is also fun and dazzling with colours. The fiesta starts when Donald gets three presents from his friends in Brazil. One of them contains short stories from South America like \"The Flying Donkey\" and \"Pablo the Cold Bloodest Pengiun\", the second pops out his good friend from the 1943 film \"Saludos Amigos\", Jose Carioca, as I said, one of Walt's best 1940's characters shows him around South America in the storybook then the bizarreness begins when Panchito the rooster comes out of the third present with guns a blazing! It all turns into a Topsy-turvy South American Mania!! Yowee! Along the way, it was the first film in history to use cartoon characters mixing in a normal world environment as Donald fall for a real life Mexican actress. That must have been big new sign of technology back in those days. In remember as old photo in England from July, 1945 when people were sadly queueing up for rationing and the Three Caballeros was up on a billboard behind them being advertised. That must of brought them joy during the most hardest of time. I strongly recommend this movie and if you don't like it, then you're a bean-head! 10/10"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["** POSSIBLE SPOILERS AHEAD **", "\nThis film was made during World War II to expose wartime audiences to Latin American culture and to strengthen the relations between both Northern and Southern America.  It's kid-friendly but the concept will go clear over their heads, as it did mine when I first saw it on the Disney Channel as a kid (I still have it taped and love watching it to this day and I'm almost 21).  It's a nice film about Donald's birthday and his \"present\" is a cornacopia of a slideshow of Latin American culture, hosted by a smooth-talking macaw named Jose Carioca and a gun-wielding rooster named Panchito.  Of course, the portrayal of Latin Americans and their culture in this film are sugar-coated, but it gives one insight into the Northern American's perception of Latin America.  This is somewhat of a sequel to the short film, \"Saludos Amigos,\" which features some of the same things featuring Donald and Jose.  If you like Disney, you'll love this film.  The last 10 to 15 minutes of the film are rather interesting as you are taken into a short trip of Donald's sub-conscious mind."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Walt Disney's outreach to the South American market resulted in a couple of films--SALUDOS AMIGOS was the first, and THE THREE CABALLEROS came next. To make a comparison, I'd have to see \"SA\" again, but I do recall that it had some charming musical sequences.", "The same is true of THE THREE CABALLEROS, especially when the musical score includes the title song (delightully done by Panchito, Jose Carioca and Donald Duck), and repeated throughout, and ballads such as YOU BELONG TO MY HEART and HAVE YOU EVER BEEN TO BAIA? All of them are performed with some fantastic art work and animation combining live action and cartoon characters.", "The last fifteen minutes seems to be scrambling for a way to keep the viewer's attention with some explosive fireworks and a dazzling display of surrealism, minus any conception of a way to end the movie on a high note. The film itself is uneven, offering typical Disney animation for the flying donkey sequence and then resorting to over-the-top fireworks that outdo the Pink Elephants number from DUMBO. ", "But it's hard to resist the bouncy South American flavor of the score and the charming characterizations of Donald, Panchito and Jose Carioca. The stylized conception of a Mexican Christmas by artist Mary Blair is a standout among the art work involved here, although later the piñata sequence is a bit overwhelming in effects.", "The dazzling color and the music make it worth watching at least once, although it's hard to make a comparison between this and other Disney full-length features. Some of the action is fast and furious but the sort of thing that will appeal to very young children.", "Summing up: You will either love it or hate it, but if you're a Disney fan you should see it at least once."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["While little known, this is one of Disney's most inventive and delightful films, superior in imagination and sheer movie magic to all but a few of the studio's great classics. I think it was less successful than most Disney films because the subject matter -- like its near-twin Saludos Amigos, a cartoon tour of Latin America -- was and is less engaging for most people than fairy tales.", "I've traveled a bit in Latin America, and still find that this clever little film captures something sumptuous, wondrous and oddly truthful about those distant places, even if seen through a distinctly American lens. What's more, it's the most sensuous G-rate movie I've ever seen. Sambas, wild orchids, wow. ", "I was four when it came out, and it immediately became my favorite movie. Indeed, I was obsessed. In the 40s and 50s, I kept up with movie-theater schedules for miles around just on the off-chance that this, and one or two other favorites, might be playing somewhere, usually at a Saturday matinée within driving distance. Every few years, my vigilance paid off and I would bug my mother to chauffeur me miles from home to see my beloved Caballeros.", "When I had children, in the early days of VCRs, we bought all the Disneys as they were released. When The Three Caballeros came out, I brought it home. I was careful not to tell my three young daughters how much I loved this old treasure, but when I played it for them they all shrieked, \"This is our favorite movie, Pop!\" ", "And it still is, for all of us."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is a nice little gem of golden-age Disneyana, that could have used perhaps a little more polishing.", "The Disney Studios apparently produced several pieces around the time period of this animated-live action featurette; \"Caballeros\" is probably the best known of the series.  The basic premise here is that Donald Duck is celebrating his birthday, and a large package of presents is sent to him from friends in several Latin American countries.  The event turns into a celebration of Latin culture, focusing on Brazil and Mexico; Donald is given tours by two \"colleagues,\" a cigar-chomping parrot-cum-boulevardier named Joe Carioca, and Panchito, a bandito rooster (complete with never-empty six-guns).", "Perhaps twenty to thirty minutes of the piece is made up of the cartoon characters superimposed over live action, or live actors doing carefully choreographed moves in front of a screen.  The techniques are apparent to the eye, and dated by modern standards, but they were reasonable attempts to fuse the two worlds together.  More problematical to this correspondent is the last 10-15 minutes; while having a few interesting sequences, the lack of a plot (becoming a dream of random images in Donald's ever-confused thoughts) makes the section drag down the rest of the film.  Less importantly, politically correct types may object to the \"Hollywoodization\" and \"Disneyfication\" of Latin culture/music that turns it into a progression of scenes from a folkloric or idealized mariachi show.  Of course, shows like \"The Three Caballeros were never meant to show the actual grit of much of Latin American life....", "If you're looking for that reality, avoid this like the plague.  If you're looking for fun, good Hollywood-Latin music, and \"poorty girls,\" head out and rent it."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I don't consider this one of the best of Disney, but I do think it is delightful and I also think it is a little better than Saludos Amigos. The Three Caballeros is a little too short and the opening scenes are a tad too coy for my liking, but it gets much better when and if you bear with it. The animation is stunning, with rich bold colours and the characters and backgrounds are beautifully realised. The music is also memorable and give real flavour to some of the scenes. There is also much to enjoy scenes wise, the title number is filled with energy, and You Belong to My Heart is lovely. As entertaining as Jose and Panchito are, what made the movie for me was Donald falls in love with Aurora(sister of Carmen) Miranda and gets caught up in the soundtrack. The whole scene is very charming and funny, and the animated choreography is incredible. Overall, a delightful film and worth seeing for more reasons than just historical value. 8/10 Bethany Cox"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["A lot of things can be said about this movie, but no one can say it is dull. Disney's Donald Duck takes us on a scenic and musical tour of Latin America with episodes in Argentina, Brazil, and Mexico. It begins in a lively tempo and speeds up until it explodes in fireworks at the end.", "It was a big and necessary hit for Disney at the time but, in a way, it's too bad the film couldn't have been released about 1968, when so many youngsters were doing acid and weed, because this is one trippy movie. It belongs right up there with \"2001: A Space Odyssey.\" A live figure may begin to dance and sing through a cartoon village. Soon Donald Duck joins the dance. Then the lamp posts begin to sway rhythmically, and soon the buildings are bouncing up and down, and then the moon darts from side to side. The viewer may twitch a bit too, because some of the rhythm is very catchy. America gave the world jazz, and Latin America gave us the samba, the conga, the bossa nova, the tango, Carmen Miranda, Heitor Villa-Lobos, and the transplanted Manuel de Falla. And the piñata.", "It's a pageant of color and music. All but one of the tunes are converted from earlier Latin American songs and they're very catchy. Two made the Hit Parade, which was a big deal at the time -- \"Baia\", \"Brazil\", and \"You Belong To My Heart.\" It's unsophisticated cornball resembling nothing real but you can't find the exit.", "President Roosevelt was all in favor of making a movie like this, for several reasons, none of them musical. He called it \"the good neighbor policy.\" South American countries were a supply source for the Allies. We needed access to airfield like Recife in Brazil to shorten the hop to Europe. And few of us found is a sound idea to encourage the pro-Nazi population of countries like Paraguay and Argentina.", "See it -- and have yourself an extended myoclonic spasm."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This is the seventh animated feature done by Walt Disney Animation Studio. There will be spoilers ahead:", "This film had its genesis from the success of Saludos Amigos, the film which came out of Walt Disney's decision to accept the US Department of State's request to go on a goodwill tour of South America. Disney saw it as a smart move from a business standpoint and the success of Amigos proved him right. From that success, The Three Caballeros was made.", "The structure of Caballeros is is a mix of live action and animation done in segments like Fantasia. It's episodic in nature within a framing sequence. It's Donald Duck's birthday and he receives several presents. A projector showing a documentary on birds leads things off. The appearances by the Aracaun Bird are enjoyable and make the film for me.", "Donald's friend Jose Carioca, a parrot from Brazil who first appeared in Saludos Amigos. He gives Donald a book through which they travel to Bahia, in Brazil. Donald falls in love there with a woman played by Carmen Miranda's sister Aurora.", "The third present is a rooster named Panchito, from Mexico, followed by a fourth present, a piñata. Panchito takes the three of them through a tour of Mexico, where Donald falls in love repeatedly with pretty girls in Mexico, lots of beautiful music is heard and lovely scenery is beheld.", "There are also a couple of short animated segments, one about a penguin named Pablo, who dreams of living someplace warm. Narrated by Sterling Holloway, it tells of Pablo's determined efforts to travel to someplace warmer than the South Pole and the other about a little boy in Uruguay, Gauchito and his flying donkey, Burrito. Both cartoons are cute and charming.", "The film as a whole is very effective and the music is excellently incorporated into the film segments, particularly in sync with the animation.", "This film is available on DVD, solo and in combination with Saludos Amigos and is well worth finding. Recommended."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I find it hard to believe that this was a World War II propaganda film. It doesn't really seem to fit that mold. Propaganda of the time was pretty heavy-handed, and most of it isn't all that entertaining today except as an artifact of the period. This movie is a joy to watch in its own right, and if there's an anti-fascist message embedded within, it's awfully subtle. ", "My understanding was that this was Disney's attempt to open up Central and South America as a market for their films, since the war had pretty much eliminated the European market. Whatever its pedigree, though, this is one of the few Disney videos that I don't mind watching endlessly with the kids, especially the parts that involve the titular Caballeros. ", "The movie is somewhat disjointed and episodic, but what holds it all together is good music. My least favorite episode is the story of the flying donkey, which gets old quickly, particularly since (and this is my one complaint) they chose to have a North American announcer attempt a Mexican accent. Why they could not have simply found an actual Mexican actor is beyond me - Los Angeles being in Mexico's backyard, after all. But Disney seemed to enjoy mixing and matching nationalities even into the 1960s, hiring, for example, US actors to play English characters in Mary Poppins, Treasure Island, and 101 Dalmatians; or Hayley Mills, who was a British actress who always seemed to be playing an American. In fact, the latter is something seen commonly nowadays, when it seems half the working actors in Hollywood are British subjects putting on American dialects (Hugh Laurie, Damian Lewis, Christian Bale)."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Funny, people nowadays don't seem to realize that this was a World War II propaganda film -- only one comment below makes that point. Many such features and shorts were turned out during this time, and not just from Disney; Warner Bros., MGM and others did as well. Keep this in mind and it makes a little more sense. Even more of the fractured, surreal nature of this film is explainable when viewed in the context of other Disney animated features of this time. \"Fantasia\" (of course), \"Dumbo,\" \"Pinocchio\" and other movies contained what seemed like drug- or alcohol-induced sequences (maybe someone with more intimate knowledge of Disney productions of the time can shed some light on those!). Disney also seemed eager to experiment with blending of animation and live action during this time (\"Song of the South\"). Anyway, this was aimed primarily at engendering better relations between North Americans and our ostensible allies in Latin America. The animation is very good and some of the music (especially the title song) is memorable. Watch it for what it is and enjoy!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["As we continue on this Latin American Disney adventure, the 1944 animated film \"The Three Caballeros\" should be mentioned, at least. Here, we have Donald Duck taking center stage in this movie, along with two other bird characters: Jose, and Panchito. ", "In this movie, we see four short segments that take us from Antarctica all the way up to close to here (Mexico). What makes this movie so impressive? The Spanish (and maybe the Portuguese), of course! What great way to say \"Disney = It's Educational!\" than to watch a movie immersed in the culture, history, and of course, the languages, of Latin America!", "Now, I say, this is very impressive Disney. What I just mentioned, plus the magic that our man, Walt Disney, has provided here makes \"The Three Caballeros\" one of the animated greats. Again, iDiez estrellas!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros shows Disney at a rather innovative point combining psychedelic imagery with a catchy South American beat. Years before Yellow Submarine, The Three Caballeros brought psychedelic and surreal animation to the stage. Despite a few rocky segments at the beginning, The Three Caballeros ends with energy and visual beauty.", "The plot is simple, Donald is opening birthday presents (His birthday is humorously on Friday the 13th.) and meeting his old friend Jose Carioca (the Brazilian parrot) and a new friend Panchito Pistoles (the gun-slinging Mexican rooster). The lack of a strong plot and those opening segments (well, the penguin segment was alright, but really The Flying Burrito?)are more than made up in later segments, which takes the form of a travelogue through Bahia in Brazil and Mexico. ", "First stop is Bahia with Jose where live action and animation combine o form a big pop sequence full of bright colors and rollicking samba music. Carmen Miranda's sister Aurora appears in live action singing Os Quidenes de Yaya (The Cookies of Yaya) followed by a surrealist trip through a dance hall full of brightly colored circles, musical instruments playing themselves, and roosters turning into dancers.", "The second part is a our tour through Mexico on the magical serape. Here Donald chases girls on the beach, dances in traditional Mexican dances and falls in love with a girl singing You Belong to My Heart in Mexico City's nightlife. Thsi leads to one of the most surreal sequences in animation history, full of bouncing flowers, girls running around in neon colors, and a horse with women's legs. This ends in a big sequence with dancing cacti. All finally ends in a fireworks display full of color, and The Three Cablleros have reprise of their signature song.", "Overall, style 10/10, visuals 10/10, music 10/10, plot 7/10, screenplay 8/10."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is a much more solid product than \"Saludos Amigos.\" The animation is better, there appears to be a lot more passion put into it, unlike \"Saludos Amigos,\" where the only segment with that true Disney flair was the last ten minutes or so in Brazil. In \"Caballeros,\" the colours just pop, the characters leap off the screen. It's wonderful to look at, if not a tad exhausting. Much like \"Saludos Amigos,\" it tries to be an educational piece, telling American audiences little tidbits about their South American and Mexican neighbours. It was, as was its sister picture, an attempt at showing harmony between South and North America.", "There is not much in terms of plot. The framing device is Donald Duck opening some birthday presents, which transport him to different places in Central and South America. There are some short films, such as a little boy and his flying burro, a penguin who wants to live in the sun, and so on. These shorts are much more entertaining than those in \"Saludos Amigos.\" We also have the welcome return of José Carioca, the green parrot, who brings Donald to Bahía, where they lust after a live action woman (Aurora Miranda), who is selling cookies. There is also the introduction of our Mexican mascot, Panchito, a hyperactive rooster who dons a sombrero and carries a pair of pistols. He's as much fun as José, if only crazier. Panchito tells a very interesting story about Las Posadas, a Mexican Christmas tradition, which implements the use of the piñata. Using a magic carpet, or sarape, Panchito flies Donald and José to various places in Mexico, such as Acapulco and Pátzcuaro, where they learn various Mexican dances, and where Donald tries to get it on with the ladies. You read that right, Donald tries to get some tail on a Mexican beach. I hope Daisy doesn't find out! This is a fun little film. The main trio are enjoyable and charismatic (more so José and Panchito), and the animation is bright and well crafted, and brilliantly timed. There is also some live action and cartoon mixing, which is not as impressive as later Disney ventures, but still impressive for this time. The ending gets a bit too heavy on the dancing and partying, and never slows down to take a breather. There is a lack of focus, but it seems that was the intention. Regardless, the animation is so nice, the characters so likable, and the music so catchy and fun, that it makes \"The Three Caballeros\" a unique, enjoyable experience, with plenty of culture and atmosphere."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is one of the most unusual of oddities in the Disney animated canon. It's arguably the package feature which requires to be seen altogether the most (that is not to say that these such films deserve to go cut up and remain only viewed as separate short subjects and featurettes; it's just that they could and have easily been viewed as separate things). Regardless, it still doesn't have much of a plot. Donald Duck receives a whole load of birthday presents from his friends in Latin America, the first of which he opens being a film reel exhibiting short subjects concerning Latin American themes and stories. However, the film soon deviates as Donald's eccentric friends Jose Carioca (a parrot from Brazil) and Panchito (a rooster from Mexico) arrive and via the use of some magic gifts transport Donald to their respective countries, where live-action actors and animated settings and beings interact. In my opinion, the second and third acts of the film (the first act being the assorted short films) cannot really be viewed out of context, so in some ways, the film walks the line between single story feature (such as \"Snow White\", \"Pinocchio\", \"Dumbo\" etc) and package feature.", "For those who don't know much about the context in which the film was made (I suspect that most people who are visiting this page, however, are animation buffs who will know a bit about this film), \"The Three Caballeros\" was, like the earlier \"Saludos Amigos\" (a similarly unusual entry in Disney's library of animated features), a by-product of the American government pressuring Disney to create films based around Latin American themes in order for the USA to woo neutral South America during the Second World War away from anything Axis, and respectively also make Yankees appreciate all things South of the Border. There are hints to the propaganda purposes (such as the general \"OMG, aren't Mexico and Brazil so cool?\" tone as well as the birds of South America being dubbed \"Donald's cousins\"), but overall, the film doesn't seem too dated, or as much as everyone says it has.", "\"The Three Caballeros\" is actually rather surreal. I honestly believe that such a far-out film would never get made today by such a prominent studio. It's the trippiest of Disney's animated classics easily. \"Alice in Wonderland\", as everybody jokes, is a bit of an LSD-fest in places, but its storybook roots keep it from seeming like the result of drinking something from a bottle marked \"DRINK ME\". And the high-brow spirit of \"Fantasia\" and its Rackham-esquire look has always prevented me from labelling it as truly trippy. Much of \"The Three Caballeros\", however, is so crazy that I wondered if I'd taken something by accident. The main background throughout the film is vague, changing colour to suit the mood of the scene, and the animation has no limits most of the time (for example, inanimate objects and things come to life like random, the laws of physics are disobeyed very much so and characters morph and multiply at the drop of a hat). There's even some early experiments with mixing animation and live action thrown in. Some of it is kinda lame - Aurora Miranda, playing a Brazilian cake seller, looks like she's simply walking in front of a screen where footage of Donald Duck is playing - however, some effects are quite good, such as animated cockerels morphing into live men.", "Overall, \"The Three Caballeros\" is a good film. Admittedly, the first act doesn't match the second and third act very well (it actually seems like left-overs from the tamer sister-film \"Saludos Amigos\", and some of the surrealism gets a bit too baffling to watch (the final ten minutes or so is an example of this sort). And not knowing any Portuguese, Jose Carioca can be difficult to understand, as he often spurts out the odd word or phrase in his native language. Yet the film is most certainly still worth watching, and makes for quite an underrated piece. Also recommended is \"Blame it on the Samba\" from 1948's \"Melody Time\". Whilst generally quite a dull package film, that segment is excellent. I believe that it was planned for \"The Three Caballeros\", though didn't surface until a few years later."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I bought this DVD because Donald Duck is my absolute favorite cartoon character. As a kid, I thought this was a very weird movie, and I still do! As a grown-up, though, I can appreciate the artistic and groundbreaking visuals. Donald is just absolutely hilarious in this movie, but can be at times, a little creepy in his constant womanizing. Was he a little lonely during a separation from Daisy or something?!", "Nevertheless, the movie is still entertaining. I especially liked the animation shorts at the beginning. The title song is fantastic. The story just gets a little trippy and cooky near the end, but that sort of ambitious and unique story-telling is somewhat of a rarity nowadays.", "All in all, a solid good film. Plus, with the DVD, you get the hilarious Donald short, \"Don's Fountain of Youth.\" Good stuff!", "My IMDB Rating:  7/10 My Yahoo! Grade:  B (Good)"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["this is good neighbor PR to Latin America? if i was from another country and viewed this as a public relations machine i would be disturbed. i would probably think Americans and the Disney people were drinking or doing drugs or had just plain lost it. whatever, as a PR machine i just wouldn't get it.", "as a mind blowingly weird cartoon i understand this. it's lunacy just seems thinly disguised as a travelogue of South America. not that the depictions of South America aren't informing or often charming and musical, the overall effect just seems to make South America seem more like 'Oz' or 'Wonderland' or something. even though a lot of the information is authentic, it makes South America come off like a fantasy or fairy tale rather than something real. and it does have a tendency to make Latin Americans come off as characters in a Disney cartoon rather than real people. especially in the bathing beauty beach scene with Pato Donald.", "i'm not saying a lot of this isn't the usual Disney cuteness and adorability, a lot of it is. the scene where Pato Donald does a little jitterbug at a outdoor BBQ is precious cute. it's just that when 'Caballeros' gets weird, it fries hard and acidicly. like hard core acid. most of it's visuals and humour are sharp, hot headed and bitingly caustic. although hilariously funny, it sort of leaves the viewer with a sort of a hangover and a disturbed state of mind.", "i don't think any of this is stereotypical or racist at all. in fact the film is very reverent of South America and it's culture. rather than working as propaganda for the United States, it has a reverse effect of being propaganda for South America instead. the only problem is, having been made mostly by Anglos, i'm not sure a lot of Latinos might feel comfortable being portrayed as larger than life fantasy characters out of a Disney toon. and this does have a bad tendency to portray Latinos as \"cute\" and doing \"cute\" things like singing about cookies and doing dances with children. however there is one tough gritty moment with a traditional cock fight. cock fighting here is illegal.", "as sharp and acerbic as 'Caballeros' gets, it's still very cute and funny and cinematically one of Disney's best works of hand drawn animation. it just sort of makes South America seem like it only exist in fairy tales or something."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Three Caballeros is a melange of various bits, ranging in quality from rather dull to excitingly creative. It starts out with a couple of ordinary cartoon shorts but then heats up considerably with the introduction of the Brazilian charmer, Joe Carioca. With the exception of two short limited animation segments, the rest of the film is wonderful. There is some fine work in which the animated characters are incorporated into live-action musical sequences. There is also much inventive kaleidoscopic animation, every bit as good as the pink elephant scene in Dumbo. This is one of the best animated feature films."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["People who went to see Disney's compilation features of the 1940s expecting another \"Fantasia\" were always disappointed - however good the material in some of them.  They weren't really films.  This one is just a collection of beads from the studio's Latin American years on a pretty string.  Some of the beads are short cartoons, not really any different from Disney's other short cartoons of the period - which is, although I don't need to say this, praise.  To be honest I find it hard to remember, without looking it up, exactly which South American Disney cartoons are featured in this movie and which aren't.", "The linking segments with Donald Duck are weird and - now and then - wonderful.  Disney seems to have tried every possible way of combining animation and live action (the live action is usually Carmen Miranda). Some of the attempts fall flat - many shots are obviously Miranda walking in front of a movie screen onto which Donald Duck is being projected; and the section featuring Donald Duck flying on a magic carpet over South American countryside is just a cheap and gruesome mis-match.  But other times it's dazzling.  The transformation of animated cacti into human dancers, or human dancers into animated roosters, are technical marvels which made me gasp. Perhaps if I saw them on the big screen I'd be able to work out how they were done - but they'd still be spectacular.  More so.", "In short, this certainly has its moments - some of the most anarchic moments Disney or any other studio had produced.  People who aren't fans of animation will probably find it unendurable.  (I don't blame them.  It's not really a film.)  People who are fans HAVE to see it."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The 7th animated Disney classic is clearly not one of Disney's best works. Nevertheless, it is one of their most different. I guess I can say that this movie has something to offer.", "This must have been the very first movie that combines live-action with animation... or at least one of the first movies to do so. This combination works out reasonably, but some movies are more successful in this \"marriage\": for example, \"Who Framed Roger Rabbit\", \"Pete's Dragon\", \"Mary Poppins\" and the documentary \"Man, Monsters and Mysteries\". As much as this is true, it isn't any less true that this combination in \"The Three Caballeros\" works out clearly better than in \"Space Jam\", for example.", "Without being a super movie and despite the fact that this movie doesn't age as well as most Disney animated classics (\"Pinocchio\", \"Fantasia\", \"Bambi\", \"The Aristocats\", \"Robin Hood\", \"The Rescuers\", \"The Fox and the Hound\", \"The Little Mermaid\", among many others...), it is however a curious and peculiar little film.", "The most interesting thing about this movie is that it takes us through Latin America, mostly Brazil and Mexico.", "The story takes place on Donald Duck's birthday and he receives lots of presents: shorts about tropical Latin America, different kinds of birds, etc... and he's joined by José Carioca aka Zé Carioca (the green parrot) and later by Panchito Pistoles (the pistol-packing red rooster). José Carioca represents Brazil and takes Donald Duck to Baía, while Panchito represents Mexico and takes both Donald Duck and Zé Carioca to Mexico.", "During its last 15 minutes more or less, the movie gets gradually less interesting, becoming somewhat empty and lame, with things that don't make much sense to me.", "By the way, this movie has some fabulous artwork. The \"three caballeros\" are very well designed (Donald Duck is very well drawn now) and the artwork of Latin America is spectacular. For example, Baía is very beautifully drawn, with gorgeous sunset, life, great monuments and a romantic atmosphere at the sound of a beautiful song with the same name as the city/village.", "There's also some great voice actors: the inimitable Clarence Nash as Donald Duck, José Oliveira as José Carioca and Joaquin Garay as Panchito. Just for the record, Joaquin Garay is the father of Joaquin Garay III (Paco from \"Herbie Goes Bananas\")."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["In a technologically advanced cartoon with stunning visuals and beautiful groundbreaking color and animation, Disney took on role as an ambassador between the citizens of the United States and their strange, dark-skinned, maybe primitive but recently allied next-door-neighbor, Latin America. The year was 1945, and the rage was exoto-tourism.", "The idea was to introduce the United States to the color and excitement of Central and South America. To our main character Donald, the good old-fashioned patriotic American Duck, the worlds shown to him by his Latino bird buddies are far from familiar. Foreign music, seemingly tribal dancing, beautiful women and exotic landscapes overwhelm Donald, and he becomes infatuated. This unknown world holds the same appeal and excitement to Donald and it probably did to countless European explorers. In fact, the scenes depicting the bizarre customs, cultures and landscapes in the movie hold the same kind of colonizing curiosity of earlier times before and during Western exploration. It is human (and maybe even Anatidaean) instinct to be curious about the unknown.", "Unfortunately, it is also human instinct to make generalities. We find here a very large contradiction, perhaps even a paradox. While the cultures of Donald's friends, the Brazilian and the Mexican, are about as similar as a parrot is to a rooster, the film portrays them as almost identical. In Brazil we find a beautiful town full of beautiful people with dark hair and darker eyes, singing dancing and having quite a time. In Mexico, it's about the same, but maybe with more of a vaquero-esquire vibe. It seems The Three Caballeros de-racializes Latin America and disregards Brazil's African roots as well as Mexico's numerous indigenous roots, kneading and forming them into one homogeneous brown-skinned singing and dancing culture.", "So now we know they're friendly. It's okay, we can go for a trip to Acapulco and sunbathe with some beautifully bronzed female Mexican centuplets. We'll drink, we'll dance, we'll embrace and kiss and be merry, however not ever with another male. The film quickly shows that while Latin American men can have a gay time, they certainly aren't gay gay, The rooster (or was it the parrot?) adamantly make this clear by rejecting Donald's kiss. But don't worry; Donald thought he was a girl. Americans sure as hell aren't gay, either.", "Well I feel guilty now for bringing all of this up. I'm sure Disney had the best intentions in introducing the U.S. to the neighbors below. A cartoon-documentary marking the full history of every diverse Latin American country using cell animation in 1945 would take longer to create than the pyramids did. And who knows if it would have held an audience's attention? The point is that despite these intolerant tendencies in The Three Caballeros, whether intentional or due to naivety, the brief exploration of the Latin American unknown in this visually stunning film may have been a pretty decent introduction for a 1945 United States audience."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["In the 1940s, Walt Disney's company was hitting a massive financial slump when their movies, besides Dumbo, were failing at the box office and the WWII army occupied the studio. So until Cinderella came around, they only ended up making second rate package films. One of them, being The Three Caballeros, is often cited as one of the better anthology flicks based on public perception and nostalgia, but I have to admit, I found this movie to be too overwhelming in a bad way. I admire it for all the technical wonder that was put into it, but this flick is a jumbled mess.", "Now even though this feature does have a plethora of segments shown throughout, it does actually have somewhat of a narrative. The essential bare bones plot revolves around Donald Duck receiving three individual presents on his birthday. One of them is a projector showcasing several different shorts on birds and winged animals, the other is Jose Carioca showcasing Donald all the wonders of Brazil and Bahia, and the last one is the Mexican rooster Panchito Pistoles showcasing all the wonders of Mexico and a crazy piñata. However, even though these segments are admirable in their own regard, the best way to describe the whole structure of the feature is like being at a party; it's fun at first but then it gets exhausting after some time. The segments in the first act are enjoyable enough on their own, and the musical moments are really fun to watch. Unfortunately, a good chunk of the 2nd act is just dancing and partying without much really going on and the third segment is just Donald trying to get with a beautiful lady....riveting.", "Ironically, the movie tries so hard to cram in as much entertainment value as it can that it ends up becoming an absolute chore to sit through. I will admit that plenty of the segments are fun, but there's so much going on that I find it hard to watch a whole 72 minute long feature consisting of them. Maybe if they were just individual shorts released before other films they would have been more tolerable, but cramming all of them into a movie just makes my head hurt. It doesn't help that when you get down to it, there isn't much of a proper story. All the film does is present three gifts filled with partying and Latino magic and....that's it. I'm not saying every movie needs a traditionally structured plot, but there is little to no momentum in this film at all. Maybe if it ended with Donald's gifts burning or Donald waking up from a dream I would have felt some something, but otherwise I feel as if this film forgot whatever it was supposed to be in the long run.", "In terms of the animation itself, there is certainly a lot of passion shown on screen. The lighting and effects are glorious, the character animation is very cartoony and loose, and even the production design is worth analyzing. As chaotic as the film is, at least the animators knew how to have fun with themselves. In addition, this is one of the first Disney films to mix live-action with animation, and while better usages would come decades later, they actually look pretty convincing for their time. Also, I must give props to the singing and the song choices, as listening to these songs will make anyone jump out of their seat and dance to it all. Although, just because these musical numbers are fun to listen to sporadically does not mean mashing them together is a good idea, and that's why this film kind of fails in the long run.", "I'm not going to lie, I really do appreciate a lot of the small stories, animation, music and even humor of The Three Caballeros, and there's no denying how much effort and craftsmanship was put into it. However, seeing all this great stuff crammed into 72 minutes worth of a movie just feels irritating, because too much of them is way too much to handle. You can have all the dancing and pizazz you want, but when you sacrifice an actual story for it all, something that every film needs to work, it just comes off as tiring and repetitive. If you want to give this a watch, just watch the segments individually, because you'll have a much easier time sitting through them then wasting 72 minutes on a pointless pasteup flick. Thank goodness Disney stopped doing package films after Cinderella became a hit, because the more we would get of this, the less magic would be prevalent."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Among his birthday presents, Donald Duck finds a projector, a screen and a roll of film.  He puts them on and finds it is a film about his Southern relations - a subject Donald would confess he knows very little about.  He watches several stories about a cold penguin, a flying donkey and a cigar chewing parrot who introduces him to the beauties (literally) of Brazilian and Mexican culture.", "This film was made in an attempt to expose American audiences to cultures other than their own and encourage understanding - apparently, back in the 1940's, America was an insular country with little tolerance or understanding of the issues regarding the rest of the world (of course, that's all changed now).  Anyway, in trying to do this, it is difficult to fault the film for it's intensions but it is a lot easier to fault it for it's accomplishments.  The basic plot is split into several sections based around several characters.  The first few are more or less cartoons that don't really comment much on the other cultures, but the second half mixes animation with live action in an attempt to show how much fun Brazil and Mexico can be.", "The first half is bright and colourful and may distract young children but the second half is only interesting because it is rhythmic and energetic - but did it help me appreciate Mexico? Nope!  For me, the bigger failing was that this film wasn't very funny.  However I suspected that as I came to it - I am more of a Loony Tunes fan as I prefer the madcap comedy that those cartoons bring rather than the more `wholesome' fun of Disney cartoons of the period.", "If I had to pick one cartoon duck, it would be Daffy of course, and I'm not a big fan of Donald simply because I can't understand what he is saying half the time.  The various other players here are colourful and do what they are required to do but again I prefer a bit of an edge on my characters - and Disney is not the place to get that.  The real people are OK but are not really the people you would have seen in these place at the time (or even now!).  They are very airbrushed and more often than not they are have had `ethnic' qualities reduced to costume in an effort to show how `they look just like us'.", "Overall this is a bright and colourful feature that will distract young children.  It doesn't achieve it's aim of enlightening about other cultures, nor does it have much of a story or laughs to keep adults interesting.  It is a worthy try and will appeal to Disney fans but most others will have pressed `stop' before the end."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I thought this movie was made during the late sixties where hallucinagenic drugs were readily available. When I found out it was made in 1945, it makes me wonder how anyone ever thought of this sober. ", "This \"movie\" is just one long music video. MTV wishes it could be this creative. Donald Duck visits different parts of Mexico and Brazil, sometimes flying on a magic carpet, sometimes riding trains through pop-up books and other weird things.", "The final 10-15 is an experience. The movie just totally freaks out. It's a kalaedeskope of colors, a psychedellic experience before there were psychedelic experiences. ", "This movie may be a little tedious to watch but the decent songs and the sometimes funny characters should be able to pull you through."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["If your kids like this film, IMDb recommends Fellini's 8½! Yeah, this one's weirder than you thought.", "The Three Caballeros is essentially a barely narrative series of experimental animated shorts, starting in nature film parody, progressing to a couple of early live-action/animation hybrids, and ending in a lustful interspecies psychedelic freakout--needless to say, it's an influential film. You might have to gag through some touristy Latinisms, but there's some prime Disney surrealism waiting for you if you do.", "-TK 11/2/10"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Let me explain my summary. When you are a kid and it's Christmas, think of what it would be like if ALL the beautifully wrapped presents under the tree are actually nothing but underwear! After all, you have very high hopes....only to be bitterly disappointed. As a child, I saw this film and was psyched when it began. The film DID star Donald Duck and like all sane kids, I loved the duck. But then,....it all struck me. It was about as fun as the underwear! Singing, dancing and a travelogue! That was NOT what I'd anticipated. Years later, I rented the film again...assuming my childhood memories must have been wrong. They weren't. The film is a dull and only good to be used as a means to punish misbehaving children. I could imagine a parent saying \"If you are good, I'll buy you BEAUTY AND THE BEAST...but if you're bad, THE THREE CABALLEROS!!!\". Proof that not everything Disney is good.", "Aside from nice animation and a catchy theme song, this is dull from start to finish."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This is Walt Disney's seven full-length animated feature film, starring Donald Duck celebrating his birthday with his two Latin American friends, José Carioca, the cigar-smoking parrot, and Panchito Pistoles, the pistol-packing rooster. The film is storied in segments, each one starting when Donald unwraps each of his presents. The segmented stories include Donald's trips to Brazil and Mexico, filmed in a combination of animation and live action.", "It is fun seeing Donald in a full-length animated movie; his feisty characteristics and bad luck-prone personality always generate a lot of humor and non-stop laughs. His adventures throughout Latin America was potentially a treat to watch and the featured music (courtesy of singers Aurora Miranda, Dora Luz and Carmen Molina) was somewhat catchy and enjoyable. However, I thought the overall movie was a little on the dull side and not very magically captivating like you would expect in many of Disney's feature films.", "While Fantasia was also filmed in segments (like this movie) and consists of music and animation only and no dialog, that movie will make you at least appreciate classical music and beautiful animation and, while no dialog, each segment is filmed in a way that represents charm and personality where you could actually follow its purpose. This film really has no plot, just a mash of animation and live action in a huge dance fest and party in Latin America. It's like a never-ending parade with nothing too intriguing to grab your attention. In addition, some of the animation looked washed-out against the live action.", "Overall, it's nice to see Donald Duck in a motion picture, but is not one of the better Disney films.", "Grade D+"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"Have you been to Baia? No? Well, let's go!\" -Joe Carioca and Donald Duck", "I have had this movie since age 8, and almost 10 years later, I still enjoy watching this movie over again.  Clarence Nash as Donald Duck is absolutely classic, and Joe Carioca and Panchito are too.", "This movie is by far the most comedic of any Disney films released, and 55 years after it's original release, it still holds up instantly as one of the greats ever produced.  This, of course, was the first Disney effort to combine live action and animation, and a better job could not be done, especially in the Baia scene with Donald, Joe and Yaya.  The movie, however, is lagged with boring music scenes, but that's no problem the fast forward button couldn't fix.  In short, if I could only recommend 1 Disney movie for your collection, it's this one."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The friends Donald made in Saludos Amigos send him several gifts for his birthday.  Eventually he hooks up with Joe Carioca and Panchito and they sing the title song before the film turns into a song filled series of travel stops.", "Over the years I've watched this movie in pieces as the bits  showed up on various Disney shows and compilation tapes but until recently I never watched the entire movie together. I had heard that it was quite good. Unfortunately who ever told me it was good never really watched it or hadn't seen it in years.", "The problem for me is that after a good opening segment of cartoons about birds the film becomes a music and dance fest. Joe Carioca and we get a song on Baia. When Panchito shows up we get surreal animation and some musical travels through Mexico.  Its nice but any hope of it being anything more than \"music video\" is washed quickly away. Perhaps its just a dislike for the images that have been married to some nice songs, but I really don't like this movie.", "The mixture of live action and animation doesn't really work. Disney had been doing that sort of thing for twenty years prior to the release of this film and I expected more. Mostly the problem is that once the animated characters leave the foreground they look like badly done rear screen projection with all the color washed out.", "If you must see this, rent it. Actually rent it for the first half, but be prepared to dislike the second."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["When I was younger I remember watching this Walt Disney classic cartoon many times, it used to be a favourite because of the star and much more, in my older age I found it reasonably entertaining as well. Basicallly Donald Duck is celebrating his birthday, and he has received a big box from his friends in Latin America, and it contains three gifts. The first gift is a film projector with a film all about fascinating birds from around the world, including the story of the penguin Pablo who travels to paradise, the eccentric Aracuan, and the story of a Gauchito who finds a flying donkey and the two of them find friendship and brief fortune. The second gift is parrot José Carioca from Rio De Janeiro in a pop up book telling Donald all about his favourite Brazilian state Bahia, and after shrinking his friend to his size he takes him on a journey to the place to meet the locals, dance the samba and see the sights. After leaving the book and using black magic to return to normal size, the two of them open the third and final gift which contains rooster Panchito the Caballero from Mexico, who gives them each a sombrero, and they become the Three Caballeros. After cracking open a piñata, Panchito takes Donald and José with them as they by flying carpet, or serape, through the pages of a book that come to life and show the many wonderful places of Mexico, such as Pátzcuaro, Vera Cruz and Acapulco beach. It is after falling in love for the woman singing in the sky that Donald enters a surreal dream like scenario where he dances along with other girls, and when he returns he has become a bull charging a red carpet, and after exploding the crackers Donald, José and Panchito huddle together to watch a fireworks display. Donald is his usual occasionally grouchy but equally enthusiastic self, and his two new friends are just as good fun to watch, but it is also a good mix of live action with the cartoon antics, especially the Bahia and beach sequences, with insights into the world of South and Latin American traditions, it is obviously very unusual in places, but with great animation and songs such as \"Baía\", \"Have You Ever Been to Baía?\", \"Os Quindins De Yayá\", the title song and \"You Belong To My Heart\" it is a good fun part-live action animated fantasy. It was nominated the Oscars for for Best Music for Edward H. Plumb, Paul J. Smith and Charles Wolcott and Best Sound. Donald Duck was number 50 on The 100 Greatest Cartoons. Worth watching!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Disney's 7th animated feature film combines animation and live action in a movie which purports to be a travelogue of Latin America in which Donald Duck sees the world, makes a couple of feathered friends, and lusts after a variety of comely young human women.", "There are a number of different sequences in the film, some musical and some not and, to be frank, not only do they not all fit well, they aren't all up to Disney's usual standard. The penguin sequence is out of place, and much of the central musical sequence, while highly imaginative, is overlong and lacks the discipline which benefited the later Pink Elephants sequence in Dumbo, for instance. And the animation itself isn't always as good as one would expect.", "And then we have the title song, about three quarters of the way through, in which it all comes gloriously together. Jam packed full of gags, musically full of joy, lyrically clever and witty, and furiously and surrealistically animated, it is a sequence of genius.", "If only the rest of the film had been as good."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["All the fully animated segment of this film are enjoyable and look good, however, the live action segments either go on longer than they should've, or have Donald duck flirting with a live action woman, which is weird."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros (1945) - 4.8", "Donald Duck gets presents from friends in Latin America", "Filmed during WW2 to bolster relations with South America", "Not much value still in this film as it's just a bunch of segments strung together, no real narrative", "Aves Raras - 4.2", "Learn about penguins coming to South America", "Learn about other birds too", "Boy catches a flying donkey and then races him", "\nBrasil - 5.8", "Meet a green parrot who tells Donald info about Brasil with songs", "Mix animated characters with real life actors in the same scene for the first time", "Very impressive for the time", "Awesome ingenuity", "Mexican bird joins to make the three Caballeros", "\nMexico - 4.5", "Gets a piñata and learn about their Christmas time", "Mexico City built over a lake", "Learn about dances and culture", "Do deal keeps saying toots and it's gross", "More real life stuff mixed in just not very compelling", "Donal goes on an acid trip and fantasizes about pretty girls", "Ends with fireworks"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The songs and the animation are fun and enjoyable. But the general 'story' is non-sensical and kinda gets forgotten toward the end of the film and everything just sort of becomes a psychedelic-Hispanic mess of color and music."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This film isn´t for me. But is better than melody time. But is horrible too"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Ever since I was a baby I wanted to see this movie and now I did so, thirty years later, I am profounded disappointed. This is nothing but wat propaganda, like what Leni Riefenstahl did for the Nazis with Triumph Des Willens: only that was interesting, and this was plainly boring. And Donald is one unfaithful horny duck!!!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["It kills me to rate any Disney movie so low, but I can't help it. I understand the history and significance of The Three Caballeros...heck, I have even been on the attraction at WDW no less than 100 times, but I couldn't get into the film. I am not sure I fully understand the movie, other than Donald visits Brazil and Mexico and somehow receives some gifts (throw in a short about a penguin). Donald's character is as like-able in this film as in any other, but the flow of the film didn't work for me. I am sure back in 1945, this film was viewed as being advanced, but it comes off a little weird for 2019. Honestly, the best scene was during the iconic Three Caballeros song, other than that, I was not impressed with the film.", "PS: The attraction makes more sense now....Visit the Mexico Pavilion in EPCOT!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Although not the best film ever, I loved it. It has an exciting and very funny story, although it is not the best movie ever. I recommend."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I loved this film when I was little. Donald Duck gets a strange birthday present. At first he watches some films about birds. One of them is about a penguin that can't keep warm while the other is about a flying donkey. Then the film gets so surreal. He opens up a book and is miniaturised to a tiny size and meets a parrot named Joe who gives him a tour of Brazil. Then Donald is horrified to learn he is so small. Joe teaches him a magic chant to make him bigger but he does something wrong and becomes a balloon. Then everything is OK and they open up their last gift which is an odd Mexican rooster. He teaches them about Mexico and then the film gets very odd when Donald is lured by a strange star woman. Suddenly, he's being stomped by cactus monsters. This film is recommended to kids mainly, not to adults. This was my favorite film when I was four."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"Saludos Amigos\" (1942) and \"The Three Caballeros\" (1944) are really dreadful Walt Disney productions, which were made during World War II supposedly to improve relations between the United States and Latin American countries. Luckily in \"The Three Caballeros\" the action only takes place in Mexico and Brazil. Of course, there are some attractive things, such as the proto-psychedelic animation of Mary Blair that would flourish in \"Alice in Wonderland\" (Disney's most \"stoned\" feature, if you ask me), but almost by rule all is offensive: stereotypes, ridiculous characters or cultural mockery. All the plot offers is Donald Duck opening presents on his birthday, from two Latin American friends: Brazilian José Carioca (from \"Saludos Amigos\") and Mexican Panchito (Villa, I suppose). Each time a box is open you watch an animated sequence of native songs (including a horrendous English version of maestro Manuel Esperón's \"Ay Jalisco no te rajes\"). Donald Duck (who looks a lot like Donald Trump in his arrogant behavior) even harasses several Latin women, anticipating the days of his namesake. The only thing that seemed fantastic to me (and it's personal taste, of course) was Carmen Miranda's sister, the sinuous Aurora Miranda who sings and dances in a beautiful and colorful musical sequence composed by Ary Barroso. If Disney has kept \"Song of the South\" out of circulation because of \"offensive treatment of African-American\" this film could deserve the same medicine. However, the only thing Disney executives seem to find objectionable is that the characters smoke, so in the DVD edition cigars and cigarettes were deleted, except the one in José Carioca's peak... As \"Saludos Amigos\", it is a schematic, silly and ugly Disney you can ignore."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["So the idea behind making \"The Three Caballeros\" was that Disney was building goodwill with Latin America. I suspect that most of the people in hispanophone and lusophone America who saw it left the theater thinking \"Disney has a weird idea of goodwill.\" Basically, it makes the region look like a nonstop party, always populated by sexy women. The representatives are a pair of exuberant birds: a suave Brazilian parrot and a hyperactive Mexican rooster. A real look at Latin America would focus on colonialism and poverty. To be certain, Brazil bulldozed favelas to make room for the World Cup stadium (which will probably never get used again).", "I know, this movie wasn't really meant to be serious. Even so, pushing stereotypes is not an authentic way to build goodwill."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["That they call this one a \"classic\" is a disgrace to all other real classics...\nAn obvious propaganda film..."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Apart from the wonderful animations and backgrounds, there is no real story to this."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I'm surprised that the Hays Office Code let Walt Disney get away with inappropriateness in cartoons before 1968, which Disney died two years before that code was eliminated. Imagine! Inter-specie intimacy! In a Disney cartoon! It would have been better off given a PG rating back when it was reissued in 1977 because of the suggestive inter-specie themes. At least this is nowhere as disgusting as the atrocious \"Foodfight!\" (don't get me started on that)."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Why don't we see more of Jose and Panchita? They are iconic and have good chemistry. Their sequences were all visually entertaining. I can't say I loved the overall film though."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["After Saludos Amigos, another short film collection was commissioned, because Disney had forgotten to say anything about Mexico. That's pretty much the reason for this film's existence, but it rises above that.", "For one, the segments are all much stronger than in Saludos Amigos. It's still mainly just an ad campaign for South America, but I like that they have a framing story where Donald is celebrating his birthday and gets a present from his South American friends. José is also back, and we get another new great character, Panchito Pistoles, a Mexican rooster. And yes, the name is kind of awful, but the character itself is a lot of fun.", "The first two segments, The Cold-Blooded Penguin and The Flying Gauchito, are both very good. The comedy is mostly silent and/or physical, the characters are sympathetic and the animation is very nice. There's also a piece about Aracuan Bird, one of the worst earworms in existence. You have been warned.", "The few following segments, Baía, Mexico: Pátzcuaro, Veracruz and Acapulco and You Belong To My Heart are merely more gallivanting around like in Saludos Amigos. They're fun to watch in their own way, the music is very nice, but they drag on for a bit too long and nothing much happens in them.", "Though at least we get the piñata scene and Las Posadas, which are some of my favourite short segments Disney has ever done. Great mood, great atmosphere, flawless animation and all around enjoyment.", "And then we have Donald's Surreal Reverie, which is probably the reason you should see this film. Think Pink Elephants on Parade, but much, much longer and ever crazier. I swear the animators were under some sort of influence, they had to be. It's a mind trip unlike anything Disney has ever produced. And yeah, it's a truckload of fun to watch, not gonna lie.", "The Three Caballeros is still not what I would call a good film. It is better than Saludos Amigos, if only because it's so weird that you cannot help but be intrigued by it. Definitely worth a watch, though, especially if you want to say you've seen them all."]}
][
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Most everything about this neat little movie has been said by previous posters, except this.", "The motivation for making it was, of all things, the US State Department! The US was deeply involved in fighting World War Two. At this point in time the average American knew almost NOTHING about South America, and the Nazi government was busy making business and political connections there, especially in Paraguay... there, transplanted Germans were a well established colony. They were aiding Hitler's war effort with the operation of industrial concerns, as well as providing espionage support.", "South America promised to become a new battlefront if German successes and infiltration continued. The region produced vital strategic raw materials, key among them rubber.", "Our strongest ally in the region was Brazil. The US Navy had a number of installations there, both sea and air. The Brazilian Navy worked closely with US forces in hunting U-boats in the Atlantic narrows; a number of US Navy vessels were transferred to them. American air bases (the largest of which was at Recife) provides home base for American aircraft, both fixed wing and lighter than air blimps, to provide air support coverage to trans Atlantic convoy operations.", "The State department felt it would be a good idea to familiarize Americans with the land, people, and way of life of South America, and called on Disney to produce THE THREE CABALLEROS. The movie was, first and foremost, a TEACHING TOOL for both military forces and the general public during a global war.", "BTW... I love the crazy little bird too! HE'S the best part of the film!", "There are two other Disney films made for the Government that I'd LOVE to find copies of.", "One is VICTORY THROUGH AIR POWER, another WW2 product.", "The other is one that I saw back in Basic Training in the 1970s. Believe it or not, the Walt Disney studios produced a military training film on the prevention of VENEREAL DISEASE!!! The unfortunate Lady dispensing said commodity bore a VERY striking resemblance to Snow White! ", "Because of that film I can never view SNOW WHITE in quite the same way ever again!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros is a lot of fun, using a mix of live action and animation to bring Brazil and Mexico alive to birthday boy Donald Duck. As he's joined by Panchito and José he realises what he has been missing all these years, falls in love with Aurora Miranda (sister of Carmen), learns to dance, and much more.", "With eye-poppingly beautiful animation and lovely colours, it is no surprise that that was the one cartoon Disney veteran Ward Kimball claimed he was truly proud of. The idea of the three birds as international musketeers living the good life is inspired and the running time is just about right."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["It was a cold January Saturday evening. The park was beautifully lit. People were cheery. We could see the Matterhorn on our right hand side. Magical is the best description I could find.", "Suddenly, I started singing...", "\"Somos los tres carros, los Tres Caballeros, y nadie es igual a nosotros...\"", "What do I know. My friends all knew the words. 4 guys, ranging from 27 to 31 years old, began forming a chrous line and singing off the top of our lungs...", "I don't know how this happened. This is not, by any stretch of imagination, a popular or wildly succesful film. I guess it just touched us, the way Donald Duck had a mexican friend (Panchito), or the wild \"Piñata\" scene, or the strong latin flavour of the film.", "Memories notwithstanding, we kept on singing... and singing... and singing.", "People around us seemed to enjoy the show, too.", "\"Valientes brillamos, como brilla un peso", "-Quien dice?!?", "NOSOTROS, LOS TRES CABALLEROS!\""]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Wildly colorful, almost hallucinogenic offering from Walt Disney plays like \"Fantasia\" on speed. Though not much more than a hodgepodge of story ideas, the film mixes live-action with animation in saluting Mexican and South American cultures. Donald Duck is the star this time, and his title musical number alongside Joe Carioca and Panchito is a head-swirling collage of colors. The Disney animators were obviously full of inspiration, but the entire movie plays like that drunken elephant sequence from \"Dumbo\": manic, fruity, sometimes quite fabulous. Entertaining to be sure, and better than its predecessor \"Saludos Amigos\", but certainly odd and never very popular from the 1940s through the 1960s since Disney rarely circulated it as a whole. *** from ****"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This was my favorite movie when I was four.  Now that I'm older, I still watch it every once in awhile, even though there are movies I like better. The Three Caballeros is full of cute humor early in the movie, and the rapport between Donald Duck and Joe Carioca is wonderful.  The animated short `The Cold-Blooded Penguin' is *very* cute, and the song `Baia' is one of my favorite Disney songs of all time.  Then Panchito arrives, and after the wonderful `Three Caballeros' song, things start to go a little bit crazy.  The plot, such as it was, completely evaporates as Donald seems to descend into a girl-crazy madness.  I'm not saying this is necessarily a bad thing, however; the final part of the movie is very entertaining, even though it's odd at the same time.  I gave this movie an 8 out of 10."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Yippie-ey-ya! This has got to be one of Disney most best ever short story movies! Not only is it educational but it is also fun and dazzling with colours. The fiesta starts when Donald gets three presents from his friends in Brazil. One of them contains short stories from South America like \"The Flying Donkey\" and \"Pablo the Cold Bloodest Pengiun\", the second pops out his good friend from the 1943 film \"Saludos Amigos\", Jose Carioca, as I said, one of Walt's best 1940's characters shows him around South America in the storybook then the bizarreness begins when Panchito the rooster comes out of the third present with guns a blazing! It all turns into a Topsy-turvy South American Mania!! Yowee! Along the way, it was the first film in history to use cartoon characters mixing in a normal world environment as Donald fall for a real life Mexican actress. That must have been big new sign of technology back in those days. In remember as old photo in England from July, 1945 when people were sadly queueing up for rationing and the Three Caballeros was up on a billboard behind them being advertised. That must of brought them joy during the most hardest of time. I strongly recommend this movie and if you don't like it, then you're a bean-head! 10/10"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["** POSSIBLE SPOILERS AHEAD **", "\nThis film was made during World War II to expose wartime audiences to Latin American culture and to strengthen the relations between both Northern and Southern America.  It's kid-friendly but the concept will go clear over their heads, as it did mine when I first saw it on the Disney Channel as a kid (I still have it taped and love watching it to this day and I'm almost 21).  It's a nice film about Donald's birthday and his \"present\" is a cornacopia of a slideshow of Latin American culture, hosted by a smooth-talking macaw named Jose Carioca and a gun-wielding rooster named Panchito.  Of course, the portrayal of Latin Americans and their culture in this film are sugar-coated, but it gives one insight into the Northern American's perception of Latin America.  This is somewhat of a sequel to the short film, \"Saludos Amigos,\" which features some of the same things featuring Donald and Jose.  If you like Disney, you'll love this film.  The last 10 to 15 minutes of the film are rather interesting as you are taken into a short trip of Donald's sub-conscious mind."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Walt Disney's outreach to the South American market resulted in a couple of films--SALUDOS AMIGOS was the first, and THE THREE CABALLEROS came next. To make a comparison, I'd have to see \"SA\" again, but I do recall that it had some charming musical sequences.", "The same is true of THE THREE CABALLEROS, especially when the musical score includes the title song (delightully done by Panchito, Jose Carioca and Donald Duck), and repeated throughout, and ballads such as YOU BELONG TO MY HEART and HAVE YOU EVER BEEN TO BAIA? All of them are performed with some fantastic art work and animation combining live action and cartoon characters.", "The last fifteen minutes seems to be scrambling for a way to keep the viewer's attention with some explosive fireworks and a dazzling display of surrealism, minus any conception of a way to end the movie on a high note. The film itself is uneven, offering typical Disney animation for the flying donkey sequence and then resorting to over-the-top fireworks that outdo the Pink Elephants number from DUMBO. ", "But it's hard to resist the bouncy South American flavor of the score and the charming characterizations of Donald, Panchito and Jose Carioca. The stylized conception of a Mexican Christmas by artist Mary Blair is a standout among the art work involved here, although later the piñata sequence is a bit overwhelming in effects.", "The dazzling color and the music make it worth watching at least once, although it's hard to make a comparison between this and other Disney full-length features. Some of the action is fast and furious but the sort of thing that will appeal to very young children.", "Summing up: You will either love it or hate it, but if you're a Disney fan you should see it at least once."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["While little known, this is one of Disney's most inventive and delightful films, superior in imagination and sheer movie magic to all but a few of the studio's great classics. I think it was less successful than most Disney films because the subject matter -- like its near-twin Saludos Amigos, a cartoon tour of Latin America -- was and is less engaging for most people than fairy tales.", "I've traveled a bit in Latin America, and still find that this clever little film captures something sumptuous, wondrous and oddly truthful about those distant places, even if seen through a distinctly American lens. What's more, it's the most sensuous G-rate movie I've ever seen. Sambas, wild orchids, wow. ", "I was four when it came out, and it immediately became my favorite movie. Indeed, I was obsessed. In the 40s and 50s, I kept up with movie-theater schedules for miles around just on the off-chance that this, and one or two other favorites, might be playing somewhere, usually at a Saturday matinée within driving distance. Every few years, my vigilance paid off and I would bug my mother to chauffeur me miles from home to see my beloved Caballeros.", "When I had children, in the early days of VCRs, we bought all the Disneys as they were released. When The Three Caballeros came out, I brought it home. I was careful not to tell my three young daughters how much I loved this old treasure, but when I played it for them they all shrieked, \"This is our favorite movie, Pop!\" ", "And it still is, for all of us."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is a nice little gem of golden-age Disneyana, that could have used perhaps a little more polishing.", "The Disney Studios apparently produced several pieces around the time period of this animated-live action featurette; \"Caballeros\" is probably the best known of the series.  The basic premise here is that Donald Duck is celebrating his birthday, and a large package of presents is sent to him from friends in several Latin American countries.  The event turns into a celebration of Latin culture, focusing on Brazil and Mexico; Donald is given tours by two \"colleagues,\" a cigar-chomping parrot-cum-boulevardier named Joe Carioca, and Panchito, a bandito rooster (complete with never-empty six-guns).", "Perhaps twenty to thirty minutes of the piece is made up of the cartoon characters superimposed over live action, or live actors doing carefully choreographed moves in front of a screen.  The techniques are apparent to the eye, and dated by modern standards, but they were reasonable attempts to fuse the two worlds together.  More problematical to this correspondent is the last 10-15 minutes; while having a few interesting sequences, the lack of a plot (becoming a dream of random images in Donald's ever-confused thoughts) makes the section drag down the rest of the film.  Less importantly, politically correct types may object to the \"Hollywoodization\" and \"Disneyfication\" of Latin culture/music that turns it into a progression of scenes from a folkloric or idealized mariachi show.  Of course, shows like \"The Three Caballeros were never meant to show the actual grit of much of Latin American life....", "If you're looking for that reality, avoid this like the plague.  If you're looking for fun, good Hollywood-Latin music, and \"poorty girls,\" head out and rent it."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I don't consider this one of the best of Disney, but I do think it is delightful and I also think it is a little better than Saludos Amigos. The Three Caballeros is a little too short and the opening scenes are a tad too coy for my liking, but it gets much better when and if you bear with it. The animation is stunning, with rich bold colours and the characters and backgrounds are beautifully realised. The music is also memorable and give real flavour to some of the scenes. There is also much to enjoy scenes wise, the title number is filled with energy, and You Belong to My Heart is lovely. As entertaining as Jose and Panchito are, what made the movie for me was Donald falls in love with Aurora(sister of Carmen) Miranda and gets caught up in the soundtrack. The whole scene is very charming and funny, and the animated choreography is incredible. Overall, a delightful film and worth seeing for more reasons than just historical value. 8/10 Bethany Cox"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["A lot of things can be said about this movie, but no one can say it is dull. Disney's Donald Duck takes us on a scenic and musical tour of Latin America with episodes in Argentina, Brazil, and Mexico. It begins in a lively tempo and speeds up until it explodes in fireworks at the end.", "It was a big and necessary hit for Disney at the time but, in a way, it's too bad the film couldn't have been released about 1968, when so many youngsters were doing acid and weed, because this is one trippy movie. It belongs right up there with \"2001: A Space Odyssey.\" A live figure may begin to dance and sing through a cartoon village. Soon Donald Duck joins the dance. Then the lamp posts begin to sway rhythmically, and soon the buildings are bouncing up and down, and then the moon darts from side to side. The viewer may twitch a bit too, because some of the rhythm is very catchy. America gave the world jazz, and Latin America gave us the samba, the conga, the bossa nova, the tango, Carmen Miranda, Heitor Villa-Lobos, and the transplanted Manuel de Falla. And the piñata.", "It's a pageant of color and music. All but one of the tunes are converted from earlier Latin American songs and they're very catchy. Two made the Hit Parade, which was a big deal at the time -- \"Baia\", \"Brazil\", and \"You Belong To My Heart.\" It's unsophisticated cornball resembling nothing real but you can't find the exit.", "President Roosevelt was all in favor of making a movie like this, for several reasons, none of them musical. He called it \"the good neighbor policy.\" South American countries were a supply source for the Allies. We needed access to airfield like Recife in Brazil to shorten the hop to Europe. And few of us found is a sound idea to encourage the pro-Nazi population of countries like Paraguay and Argentina.", "See it -- and have yourself an extended myoclonic spasm."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This is the seventh animated feature done by Walt Disney Animation Studio. There will be spoilers ahead:", "This film had its genesis from the success of Saludos Amigos, the film which came out of Walt Disney's decision to accept the US Department of State's request to go on a goodwill tour of South America. Disney saw it as a smart move from a business standpoint and the success of Amigos proved him right. From that success, The Three Caballeros was made.", "The structure of Caballeros is is a mix of live action and animation done in segments like Fantasia. It's episodic in nature within a framing sequence. It's Donald Duck's birthday and he receives several presents. A projector showing a documentary on birds leads things off. The appearances by the Aracaun Bird are enjoyable and make the film for me.", "Donald's friend Jose Carioca, a parrot from Brazil who first appeared in Saludos Amigos. He gives Donald a book through which they travel to Bahia, in Brazil. Donald falls in love there with a woman played by Carmen Miranda's sister Aurora.", "The third present is a rooster named Panchito, from Mexico, followed by a fourth present, a piñata. Panchito takes the three of them through a tour of Mexico, where Donald falls in love repeatedly with pretty girls in Mexico, lots of beautiful music is heard and lovely scenery is beheld.", "There are also a couple of short animated segments, one about a penguin named Pablo, who dreams of living someplace warm. Narrated by Sterling Holloway, it tells of Pablo's determined efforts to travel to someplace warmer than the South Pole and the other about a little boy in Uruguay, Gauchito and his flying donkey, Burrito. Both cartoons are cute and charming.", "The film as a whole is very effective and the music is excellently incorporated into the film segments, particularly in sync with the animation.", "This film is available on DVD, solo and in combination with Saludos Amigos and is well worth finding. Recommended."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I find it hard to believe that this was a World War II propaganda film. It doesn't really seem to fit that mold. Propaganda of the time was pretty heavy-handed, and most of it isn't all that entertaining today except as an artifact of the period. This movie is a joy to watch in its own right, and if there's an anti-fascist message embedded within, it's awfully subtle. ", "My understanding was that this was Disney's attempt to open up Central and South America as a market for their films, since the war had pretty much eliminated the European market. Whatever its pedigree, though, this is one of the few Disney videos that I don't mind watching endlessly with the kids, especially the parts that involve the titular Caballeros. ", "The movie is somewhat disjointed and episodic, but what holds it all together is good music. My least favorite episode is the story of the flying donkey, which gets old quickly, particularly since (and this is my one complaint) they chose to have a North American announcer attempt a Mexican accent. Why they could not have simply found an actual Mexican actor is beyond me - Los Angeles being in Mexico's backyard, after all. But Disney seemed to enjoy mixing and matching nationalities even into the 1960s, hiring, for example, US actors to play English characters in Mary Poppins, Treasure Island, and 101 Dalmatians; or Hayley Mills, who was a British actress who always seemed to be playing an American. In fact, the latter is something seen commonly nowadays, when it seems half the working actors in Hollywood are British subjects putting on American dialects (Hugh Laurie, Damian Lewis, Christian Bale)."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Funny, people nowadays don't seem to realize that this was a World War II propaganda film -- only one comment below makes that point. Many such features and shorts were turned out during this time, and not just from Disney; Warner Bros., MGM and others did as well. Keep this in mind and it makes a little more sense. Even more of the fractured, surreal nature of this film is explainable when viewed in the context of other Disney animated features of this time. \"Fantasia\" (of course), \"Dumbo,\" \"Pinocchio\" and other movies contained what seemed like drug- or alcohol-induced sequences (maybe someone with more intimate knowledge of Disney productions of the time can shed some light on those!). Disney also seemed eager to experiment with blending of animation and live action during this time (\"Song of the South\"). Anyway, this was aimed primarily at engendering better relations between North Americans and our ostensible allies in Latin America. The animation is very good and some of the music (especially the title song) is memorable. Watch it for what it is and enjoy!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["As we continue on this Latin American Disney adventure, the 1944 animated film \"The Three Caballeros\" should be mentioned, at least. Here, we have Donald Duck taking center stage in this movie, along with two other bird characters: Jose, and Panchito. ", "In this movie, we see four short segments that take us from Antarctica all the way up to close to here (Mexico). What makes this movie so impressive? The Spanish (and maybe the Portuguese), of course! What great way to say \"Disney = It's Educational!\" than to watch a movie immersed in the culture, history, and of course, the languages, of Latin America!", "Now, I say, this is very impressive Disney. What I just mentioned, plus the magic that our man, Walt Disney, has provided here makes \"The Three Caballeros\" one of the animated greats. Again, iDiez estrellas!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros shows Disney at a rather innovative point combining psychedelic imagery with a catchy South American beat. Years before Yellow Submarine, The Three Caballeros brought psychedelic and surreal animation to the stage. Despite a few rocky segments at the beginning, The Three Caballeros ends with energy and visual beauty.", "The plot is simple, Donald is opening birthday presents (His birthday is humorously on Friday the 13th.) and meeting his old friend Jose Carioca (the Brazilian parrot) and a new friend Panchito Pistoles (the gun-slinging Mexican rooster). The lack of a strong plot and those opening segments (well, the penguin segment was alright, but really The Flying Burrito?)are more than made up in later segments, which takes the form of a travelogue through Bahia in Brazil and Mexico. ", "First stop is Bahia with Jose where live action and animation combine o form a big pop sequence full of bright colors and rollicking samba music. Carmen Miranda's sister Aurora appears in live action singing Os Quidenes de Yaya (The Cookies of Yaya) followed by a surrealist trip through a dance hall full of brightly colored circles, musical instruments playing themselves, and roosters turning into dancers.", "The second part is a our tour through Mexico on the magical serape. Here Donald chases girls on the beach, dances in traditional Mexican dances and falls in love with a girl singing You Belong to My Heart in Mexico City's nightlife. Thsi leads to one of the most surreal sequences in animation history, full of bouncing flowers, girls running around in neon colors, and a horse with women's legs. This ends in a big sequence with dancing cacti. All finally ends in a fireworks display full of color, and The Three Cablleros have reprise of their signature song.", "Overall, style 10/10, visuals 10/10, music 10/10, plot 7/10, screenplay 8/10."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is a much more solid product than \"Saludos Amigos.\" The animation is better, there appears to be a lot more passion put into it, unlike \"Saludos Amigos,\" where the only segment with that true Disney flair was the last ten minutes or so in Brazil. In \"Caballeros,\" the colours just pop, the characters leap off the screen. It's wonderful to look at, if not a tad exhausting. Much like \"Saludos Amigos,\" it tries to be an educational piece, telling American audiences little tidbits about their South American and Mexican neighbours. It was, as was its sister picture, an attempt at showing harmony between South and North America.", "There is not much in terms of plot. The framing device is Donald Duck opening some birthday presents, which transport him to different places in Central and South America. There are some short films, such as a little boy and his flying burro, a penguin who wants to live in the sun, and so on. These shorts are much more entertaining than those in \"Saludos Amigos.\" We also have the welcome return of José Carioca, the green parrot, who brings Donald to Bahía, where they lust after a live action woman (Aurora Miranda), who is selling cookies. There is also the introduction of our Mexican mascot, Panchito, a hyperactive rooster who dons a sombrero and carries a pair of pistols. He's as much fun as José, if only crazier. Panchito tells a very interesting story about Las Posadas, a Mexican Christmas tradition, which implements the use of the piñata. Using a magic carpet, or sarape, Panchito flies Donald and José to various places in Mexico, such as Acapulco and Pátzcuaro, where they learn various Mexican dances, and where Donald tries to get it on with the ladies. You read that right, Donald tries to get some tail on a Mexican beach. I hope Daisy doesn't find out! This is a fun little film. The main trio are enjoyable and charismatic (more so José and Panchito), and the animation is bright and well crafted, and brilliantly timed. There is also some live action and cartoon mixing, which is not as impressive as later Disney ventures, but still impressive for this time. The ending gets a bit too heavy on the dancing and partying, and never slows down to take a breather. There is a lack of focus, but it seems that was the intention. Regardless, the animation is so nice, the characters so likable, and the music so catchy and fun, that it makes \"The Three Caballeros\" a unique, enjoyable experience, with plenty of culture and atmosphere."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"The Three Caballeros\" is one of the most unusual of oddities in the Disney animated canon. It's arguably the package feature which requires to be seen altogether the most (that is not to say that these such films deserve to go cut up and remain only viewed as separate short subjects and featurettes; it's just that they could and have easily been viewed as separate things). Regardless, it still doesn't have much of a plot. Donald Duck receives a whole load of birthday presents from his friends in Latin America, the first of which he opens being a film reel exhibiting short subjects concerning Latin American themes and stories. However, the film soon deviates as Donald's eccentric friends Jose Carioca (a parrot from Brazil) and Panchito (a rooster from Mexico) arrive and via the use of some magic gifts transport Donald to their respective countries, where live-action actors and animated settings and beings interact. In my opinion, the second and third acts of the film (the first act being the assorted short films) cannot really be viewed out of context, so in some ways, the film walks the line between single story feature (such as \"Snow White\", \"Pinocchio\", \"Dumbo\" etc) and package feature.", "For those who don't know much about the context in which the film was made (I suspect that most people who are visiting this page, however, are animation buffs who will know a bit about this film), \"The Three Caballeros\" was, like the earlier \"Saludos Amigos\" (a similarly unusual entry in Disney's library of animated features), a by-product of the American government pressuring Disney to create films based around Latin American themes in order for the USA to woo neutral South America during the Second World War away from anything Axis, and respectively also make Yankees appreciate all things South of the Border. There are hints to the propaganda purposes (such as the general \"OMG, aren't Mexico and Brazil so cool?\" tone as well as the birds of South America being dubbed \"Donald's cousins\"), but overall, the film doesn't seem too dated, or as much as everyone says it has.", "\"The Three Caballeros\" is actually rather surreal. I honestly believe that such a far-out film would never get made today by such a prominent studio. It's the trippiest of Disney's animated classics easily. \"Alice in Wonderland\", as everybody jokes, is a bit of an LSD-fest in places, but its storybook roots keep it from seeming like the result of drinking something from a bottle marked \"DRINK ME\". And the high-brow spirit of \"Fantasia\" and its Rackham-esquire look has always prevented me from labelling it as truly trippy. Much of \"The Three Caballeros\", however, is so crazy that I wondered if I'd taken something by accident. The main background throughout the film is vague, changing colour to suit the mood of the scene, and the animation has no limits most of the time (for example, inanimate objects and things come to life like random, the laws of physics are disobeyed very much so and characters morph and multiply at the drop of a hat). There's even some early experiments with mixing animation and live action thrown in. Some of it is kinda lame - Aurora Miranda, playing a Brazilian cake seller, looks like she's simply walking in front of a screen where footage of Donald Duck is playing - however, some effects are quite good, such as animated cockerels morphing into live men.", "Overall, \"The Three Caballeros\" is a good film. Admittedly, the first act doesn't match the second and third act very well (it actually seems like left-overs from the tamer sister-film \"Saludos Amigos\", and some of the surrealism gets a bit too baffling to watch (the final ten minutes or so is an example of this sort). And not knowing any Portuguese, Jose Carioca can be difficult to understand, as he often spurts out the odd word or phrase in his native language. Yet the film is most certainly still worth watching, and makes for quite an underrated piece. Also recommended is \"Blame it on the Samba\" from 1948's \"Melody Time\". Whilst generally quite a dull package film, that segment is excellent. I believe that it was planned for \"The Three Caballeros\", though didn't surface until a few years later."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I bought this DVD because Donald Duck is my absolute favorite cartoon character. As a kid, I thought this was a very weird movie, and I still do! As a grown-up, though, I can appreciate the artistic and groundbreaking visuals. Donald is just absolutely hilarious in this movie, but can be at times, a little creepy in his constant womanizing. Was he a little lonely during a separation from Daisy or something?!", "Nevertheless, the movie is still entertaining. I especially liked the animation shorts at the beginning. The title song is fantastic. The story just gets a little trippy and cooky near the end, but that sort of ambitious and unique story-telling is somewhat of a rarity nowadays.", "All in all, a solid good film. Plus, with the DVD, you get the hilarious Donald short, \"Don's Fountain of Youth.\" Good stuff!", "My IMDB Rating:  7/10 My Yahoo! Grade:  B (Good)"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["this is good neighbor PR to Latin America? if i was from another country and viewed this as a public relations machine i would be disturbed. i would probably think Americans and the Disney people were drinking or doing drugs or had just plain lost it. whatever, as a PR machine i just wouldn't get it.", "as a mind blowingly weird cartoon i understand this. it's lunacy just seems thinly disguised as a travelogue of South America. not that the depictions of South America aren't informing or often charming and musical, the overall effect just seems to make South America seem more like 'Oz' or 'Wonderland' or something. even though a lot of the information is authentic, it makes South America come off like a fantasy or fairy tale rather than something real. and it does have a tendency to make Latin Americans come off as characters in a Disney cartoon rather than real people. especially in the bathing beauty beach scene with Pato Donald.", "i'm not saying a lot of this isn't the usual Disney cuteness and adorability, a lot of it is. the scene where Pato Donald does a little jitterbug at a outdoor BBQ is precious cute. it's just that when 'Caballeros' gets weird, it fries hard and acidicly. like hard core acid. most of it's visuals and humour are sharp, hot headed and bitingly caustic. although hilariously funny, it sort of leaves the viewer with a sort of a hangover and a disturbed state of mind.", "i don't think any of this is stereotypical or racist at all. in fact the film is very reverent of South America and it's culture. rather than working as propaganda for the United States, it has a reverse effect of being propaganda for South America instead. the only problem is, having been made mostly by Anglos, i'm not sure a lot of Latinos might feel comfortable being portrayed as larger than life fantasy characters out of a Disney toon. and this does have a bad tendency to portray Latinos as \"cute\" and doing \"cute\" things like singing about cookies and doing dances with children. however there is one tough gritty moment with a traditional cock fight. cock fighting here is illegal.", "as sharp and acerbic as 'Caballeros' gets, it's still very cute and funny and cinematically one of Disney's best works of hand drawn animation. it just sort of makes South America seem like it only exist in fairy tales or something."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Three Caballeros is a melange of various bits, ranging in quality from rather dull to excitingly creative. It starts out with a couple of ordinary cartoon shorts but then heats up considerably with the introduction of the Brazilian charmer, Joe Carioca. With the exception of two short limited animation segments, the rest of the film is wonderful. There is some fine work in which the animated characters are incorporated into live-action musical sequences. There is also much inventive kaleidoscopic animation, every bit as good as the pink elephant scene in Dumbo. This is one of the best animated feature films."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["People who went to see Disney's compilation features of the 1940s expecting another \"Fantasia\" were always disappointed - however good the material in some of them.  They weren't really films.  This one is just a collection of beads from the studio's Latin American years on a pretty string.  Some of the beads are short cartoons, not really any different from Disney's other short cartoons of the period - which is, although I don't need to say this, praise.  To be honest I find it hard to remember, without looking it up, exactly which South American Disney cartoons are featured in this movie and which aren't.", "The linking segments with Donald Duck are weird and - now and then - wonderful.  Disney seems to have tried every possible way of combining animation and live action (the live action is usually Carmen Miranda). Some of the attempts fall flat - many shots are obviously Miranda walking in front of a movie screen onto which Donald Duck is being projected; and the section featuring Donald Duck flying on a magic carpet over South American countryside is just a cheap and gruesome mis-match.  But other times it's dazzling.  The transformation of animated cacti into human dancers, or human dancers into animated roosters, are technical marvels which made me gasp. Perhaps if I saw them on the big screen I'd be able to work out how they were done - but they'd still be spectacular.  More so.", "In short, this certainly has its moments - some of the most anarchic moments Disney or any other studio had produced.  People who aren't fans of animation will probably find it unendurable.  (I don't blame them.  It's not really a film.)  People who are fans HAVE to see it."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The 7th animated Disney classic is clearly not one of Disney's best works. Nevertheless, it is one of their most different. I guess I can say that this movie has something to offer.", "This must have been the very first movie that combines live-action with animation... or at least one of the first movies to do so. This combination works out reasonably, but some movies are more successful in this \"marriage\": for example, \"Who Framed Roger Rabbit\", \"Pete's Dragon\", \"Mary Poppins\" and the documentary \"Man, Monsters and Mysteries\". As much as this is true, it isn't any less true that this combination in \"The Three Caballeros\" works out clearly better than in \"Space Jam\", for example.", "Without being a super movie and despite the fact that this movie doesn't age as well as most Disney animated classics (\"Pinocchio\", \"Fantasia\", \"Bambi\", \"The Aristocats\", \"Robin Hood\", \"The Rescuers\", \"The Fox and the Hound\", \"The Little Mermaid\", among many others...), it is however a curious and peculiar little film.", "The most interesting thing about this movie is that it takes us through Latin America, mostly Brazil and Mexico.", "The story takes place on Donald Duck's birthday and he receives lots of presents: shorts about tropical Latin America, different kinds of birds, etc... and he's joined by José Carioca aka Zé Carioca (the green parrot) and later by Panchito Pistoles (the pistol-packing red rooster). José Carioca represents Brazil and takes Donald Duck to Baía, while Panchito represents Mexico and takes both Donald Duck and Zé Carioca to Mexico.", "During its last 15 minutes more or less, the movie gets gradually less interesting, becoming somewhat empty and lame, with things that don't make much sense to me.", "By the way, this movie has some fabulous artwork. The \"three caballeros\" are very well designed (Donald Duck is very well drawn now) and the artwork of Latin America is spectacular. For example, Baía is very beautifully drawn, with gorgeous sunset, life, great monuments and a romantic atmosphere at the sound of a beautiful song with the same name as the city/village.", "There's also some great voice actors: the inimitable Clarence Nash as Donald Duck, José Oliveira as José Carioca and Joaquin Garay as Panchito. Just for the record, Joaquin Garay is the father of Joaquin Garay III (Paco from \"Herbie Goes Bananas\")."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["In a technologically advanced cartoon with stunning visuals and beautiful groundbreaking color and animation, Disney took on role as an ambassador between the citizens of the United States and their strange, dark-skinned, maybe primitive but recently allied next-door-neighbor, Latin America. The year was 1945, and the rage was exoto-tourism.", "The idea was to introduce the United States to the color and excitement of Central and South America. To our main character Donald, the good old-fashioned patriotic American Duck, the worlds shown to him by his Latino bird buddies are far from familiar. Foreign music, seemingly tribal dancing, beautiful women and exotic landscapes overwhelm Donald, and he becomes infatuated. This unknown world holds the same appeal and excitement to Donald and it probably did to countless European explorers. In fact, the scenes depicting the bizarre customs, cultures and landscapes in the movie hold the same kind of colonizing curiosity of earlier times before and during Western exploration. It is human (and maybe even Anatidaean) instinct to be curious about the unknown.", "Unfortunately, it is also human instinct to make generalities. We find here a very large contradiction, perhaps even a paradox. While the cultures of Donald's friends, the Brazilian and the Mexican, are about as similar as a parrot is to a rooster, the film portrays them as almost identical. In Brazil we find a beautiful town full of beautiful people with dark hair and darker eyes, singing dancing and having quite a time. In Mexico, it's about the same, but maybe with more of a vaquero-esquire vibe. It seems The Three Caballeros de-racializes Latin America and disregards Brazil's African roots as well as Mexico's numerous indigenous roots, kneading and forming them into one homogeneous brown-skinned singing and dancing culture.", "So now we know they're friendly. It's okay, we can go for a trip to Acapulco and sunbathe with some beautifully bronzed female Mexican centuplets. We'll drink, we'll dance, we'll embrace and kiss and be merry, however not ever with another male. The film quickly shows that while Latin American men can have a gay time, they certainly aren't gay gay, The rooster (or was it the parrot?) adamantly make this clear by rejecting Donald's kiss. But don't worry; Donald thought he was a girl. Americans sure as hell aren't gay, either.", "Well I feel guilty now for bringing all of this up. I'm sure Disney had the best intentions in introducing the U.S. to the neighbors below. A cartoon-documentary marking the full history of every diverse Latin American country using cell animation in 1945 would take longer to create than the pyramids did. And who knows if it would have held an audience's attention? The point is that despite these intolerant tendencies in The Three Caballeros, whether intentional or due to naivety, the brief exploration of the Latin American unknown in this visually stunning film may have been a pretty decent introduction for a 1945 United States audience."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["In the 1940s, Walt Disney's company was hitting a massive financial slump when their movies, besides Dumbo, were failing at the box office and the WWII army occupied the studio. So until Cinderella came around, they only ended up making second rate package films. One of them, being The Three Caballeros, is often cited as one of the better anthology flicks based on public perception and nostalgia, but I have to admit, I found this movie to be too overwhelming in a bad way. I admire it for all the technical wonder that was put into it, but this flick is a jumbled mess.", "Now even though this feature does have a plethora of segments shown throughout, it does actually have somewhat of a narrative. The essential bare bones plot revolves around Donald Duck receiving three individual presents on his birthday. One of them is a projector showcasing several different shorts on birds and winged animals, the other is Jose Carioca showcasing Donald all the wonders of Brazil and Bahia, and the last one is the Mexican rooster Panchito Pistoles showcasing all the wonders of Mexico and a crazy piñata. However, even though these segments are admirable in their own regard, the best way to describe the whole structure of the feature is like being at a party; it's fun at first but then it gets exhausting after some time. The segments in the first act are enjoyable enough on their own, and the musical moments are really fun to watch. Unfortunately, a good chunk of the 2nd act is just dancing and partying without much really going on and the third segment is just Donald trying to get with a beautiful lady....riveting.", "Ironically, the movie tries so hard to cram in as much entertainment value as it can that it ends up becoming an absolute chore to sit through. I will admit that plenty of the segments are fun, but there's so much going on that I find it hard to watch a whole 72 minute long feature consisting of them. Maybe if they were just individual shorts released before other films they would have been more tolerable, but cramming all of them into a movie just makes my head hurt. It doesn't help that when you get down to it, there isn't much of a proper story. All the film does is present three gifts filled with partying and Latino magic and....that's it. I'm not saying every movie needs a traditionally structured plot, but there is little to no momentum in this film at all. Maybe if it ended with Donald's gifts burning or Donald waking up from a dream I would have felt some something, but otherwise I feel as if this film forgot whatever it was supposed to be in the long run.", "In terms of the animation itself, there is certainly a lot of passion shown on screen. The lighting and effects are glorious, the character animation is very cartoony and loose, and even the production design is worth analyzing. As chaotic as the film is, at least the animators knew how to have fun with themselves. In addition, this is one of the first Disney films to mix live-action with animation, and while better usages would come decades later, they actually look pretty convincing for their time. Also, I must give props to the singing and the song choices, as listening to these songs will make anyone jump out of their seat and dance to it all. Although, just because these musical numbers are fun to listen to sporadically does not mean mashing them together is a good idea, and that's why this film kind of fails in the long run.", "I'm not going to lie, I really do appreciate a lot of the small stories, animation, music and even humor of The Three Caballeros, and there's no denying how much effort and craftsmanship was put into it. However, seeing all this great stuff crammed into 72 minutes worth of a movie just feels irritating, because too much of them is way too much to handle. You can have all the dancing and pizazz you want, but when you sacrifice an actual story for it all, something that every film needs to work, it just comes off as tiring and repetitive. If you want to give this a watch, just watch the segments individually, because you'll have a much easier time sitting through them then wasting 72 minutes on a pointless pasteup flick. Thank goodness Disney stopped doing package films after Cinderella became a hit, because the more we would get of this, the less magic would be prevalent."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Among his birthday presents, Donald Duck finds a projector, a screen and a roll of film.  He puts them on and finds it is a film about his Southern relations - a subject Donald would confess he knows very little about.  He watches several stories about a cold penguin, a flying donkey and a cigar chewing parrot who introduces him to the beauties (literally) of Brazilian and Mexican culture.", "This film was made in an attempt to expose American audiences to cultures other than their own and encourage understanding - apparently, back in the 1940's, America was an insular country with little tolerance or understanding of the issues regarding the rest of the world (of course, that's all changed now).  Anyway, in trying to do this, it is difficult to fault the film for it's intensions but it is a lot easier to fault it for it's accomplishments.  The basic plot is split into several sections based around several characters.  The first few are more or less cartoons that don't really comment much on the other cultures, but the second half mixes animation with live action in an attempt to show how much fun Brazil and Mexico can be.", "The first half is bright and colourful and may distract young children but the second half is only interesting because it is rhythmic and energetic - but did it help me appreciate Mexico? Nope!  For me, the bigger failing was that this film wasn't very funny.  However I suspected that as I came to it - I am more of a Loony Tunes fan as I prefer the madcap comedy that those cartoons bring rather than the more `wholesome' fun of Disney cartoons of the period.", "If I had to pick one cartoon duck, it would be Daffy of course, and I'm not a big fan of Donald simply because I can't understand what he is saying half the time.  The various other players here are colourful and do what they are required to do but again I prefer a bit of an edge on my characters - and Disney is not the place to get that.  The real people are OK but are not really the people you would have seen in these place at the time (or even now!).  They are very airbrushed and more often than not they are have had `ethnic' qualities reduced to costume in an effort to show how `they look just like us'.", "Overall this is a bright and colourful feature that will distract young children.  It doesn't achieve it's aim of enlightening about other cultures, nor does it have much of a story or laughs to keep adults interesting.  It is a worthy try and will appeal to Disney fans but most others will have pressed `stop' before the end."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I thought this movie was made during the late sixties where hallucinagenic drugs were readily available. When I found out it was made in 1945, it makes me wonder how anyone ever thought of this sober. ", "This \"movie\" is just one long music video. MTV wishes it could be this creative. Donald Duck visits different parts of Mexico and Brazil, sometimes flying on a magic carpet, sometimes riding trains through pop-up books and other weird things.", "The final 10-15 is an experience. The movie just totally freaks out. It's a kalaedeskope of colors, a psychedellic experience before there were psychedelic experiences. ", "This movie may be a little tedious to watch but the decent songs and the sometimes funny characters should be able to pull you through."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["If your kids like this film, IMDb recommends Fellini's 8½! Yeah, this one's weirder than you thought.", "The Three Caballeros is essentially a barely narrative series of experimental animated shorts, starting in nature film parody, progressing to a couple of early live-action/animation hybrids, and ending in a lustful interspecies psychedelic freakout--needless to say, it's an influential film. You might have to gag through some touristy Latinisms, but there's some prime Disney surrealism waiting for you if you do.", "-TK 11/2/10"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Let me explain my summary. When you are a kid and it's Christmas, think of what it would be like if ALL the beautifully wrapped presents under the tree are actually nothing but underwear! After all, you have very high hopes....only to be bitterly disappointed. As a child, I saw this film and was psyched when it began. The film DID star Donald Duck and like all sane kids, I loved the duck. But then,....it all struck me. It was about as fun as the underwear! Singing, dancing and a travelogue! That was NOT what I'd anticipated. Years later, I rented the film again...assuming my childhood memories must have been wrong. They weren't. The film is a dull and only good to be used as a means to punish misbehaving children. I could imagine a parent saying \"If you are good, I'll buy you BEAUTY AND THE BEAST...but if you're bad, THE THREE CABALLEROS!!!\". Proof that not everything Disney is good.", "Aside from nice animation and a catchy theme song, this is dull from start to finish."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This is Walt Disney's seven full-length animated feature film, starring Donald Duck celebrating his birthday with his two Latin American friends, José Carioca, the cigar-smoking parrot, and Panchito Pistoles, the pistol-packing rooster. The film is storied in segments, each one starting when Donald unwraps each of his presents. The segmented stories include Donald's trips to Brazil and Mexico, filmed in a combination of animation and live action.", "It is fun seeing Donald in a full-length animated movie; his feisty characteristics and bad luck-prone personality always generate a lot of humor and non-stop laughs. His adventures throughout Latin America was potentially a treat to watch and the featured music (courtesy of singers Aurora Miranda, Dora Luz and Carmen Molina) was somewhat catchy and enjoyable. However, I thought the overall movie was a little on the dull side and not very magically captivating like you would expect in many of Disney's feature films.", "While Fantasia was also filmed in segments (like this movie) and consists of music and animation only and no dialog, that movie will make you at least appreciate classical music and beautiful animation and, while no dialog, each segment is filmed in a way that represents charm and personality where you could actually follow its purpose. This film really has no plot, just a mash of animation and live action in a huge dance fest and party in Latin America. It's like a never-ending parade with nothing too intriguing to grab your attention. In addition, some of the animation looked washed-out against the live action.", "Overall, it's nice to see Donald Duck in a motion picture, but is not one of the better Disney films.", "Grade D+"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"Have you been to Baia? No? Well, let's go!\" -Joe Carioca and Donald Duck", "I have had this movie since age 8, and almost 10 years later, I still enjoy watching this movie over again.  Clarence Nash as Donald Duck is absolutely classic, and Joe Carioca and Panchito are too.", "This movie is by far the most comedic of any Disney films released, and 55 years after it's original release, it still holds up instantly as one of the greats ever produced.  This, of course, was the first Disney effort to combine live action and animation, and a better job could not be done, especially in the Baia scene with Donald, Joe and Yaya.  The movie, however, is lagged with boring music scenes, but that's no problem the fast forward button couldn't fix.  In short, if I could only recommend 1 Disney movie for your collection, it's this one."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The friends Donald made in Saludos Amigos send him several gifts for his birthday.  Eventually he hooks up with Joe Carioca and Panchito and they sing the title song before the film turns into a song filled series of travel stops.", "Over the years I've watched this movie in pieces as the bits  showed up on various Disney shows and compilation tapes but until recently I never watched the entire movie together. I had heard that it was quite good. Unfortunately who ever told me it was good never really watched it or hadn't seen it in years.", "The problem for me is that after a good opening segment of cartoons about birds the film becomes a music and dance fest. Joe Carioca and we get a song on Baia. When Panchito shows up we get surreal animation and some musical travels through Mexico.  Its nice but any hope of it being anything more than \"music video\" is washed quickly away. Perhaps its just a dislike for the images that have been married to some nice songs, but I really don't like this movie.", "The mixture of live action and animation doesn't really work. Disney had been doing that sort of thing for twenty years prior to the release of this film and I expected more. Mostly the problem is that once the animated characters leave the foreground they look like badly done rear screen projection with all the color washed out.", "If you must see this, rent it. Actually rent it for the first half, but be prepared to dislike the second."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["When I was younger I remember watching this Walt Disney classic cartoon many times, it used to be a favourite because of the star and much more, in my older age I found it reasonably entertaining as well. Basicallly Donald Duck is celebrating his birthday, and he has received a big box from his friends in Latin America, and it contains three gifts. The first gift is a film projector with a film all about fascinating birds from around the world, including the story of the penguin Pablo who travels to paradise, the eccentric Aracuan, and the story of a Gauchito who finds a flying donkey and the two of them find friendship and brief fortune. The second gift is parrot José Carioca from Rio De Janeiro in a pop up book telling Donald all about his favourite Brazilian state Bahia, and after shrinking his friend to his size he takes him on a journey to the place to meet the locals, dance the samba and see the sights. After leaving the book and using black magic to return to normal size, the two of them open the third and final gift which contains rooster Panchito the Caballero from Mexico, who gives them each a sombrero, and they become the Three Caballeros. After cracking open a piñata, Panchito takes Donald and José with them as they by flying carpet, or serape, through the pages of a book that come to life and show the many wonderful places of Mexico, such as Pátzcuaro, Vera Cruz and Acapulco beach. It is after falling in love for the woman singing in the sky that Donald enters a surreal dream like scenario where he dances along with other girls, and when he returns he has become a bull charging a red carpet, and after exploding the crackers Donald, José and Panchito huddle together to watch a fireworks display. Donald is his usual occasionally grouchy but equally enthusiastic self, and his two new friends are just as good fun to watch, but it is also a good mix of live action with the cartoon antics, especially the Bahia and beach sequences, with insights into the world of South and Latin American traditions, it is obviously very unusual in places, but with great animation and songs such as \"Baía\", \"Have You Ever Been to Baía?\", \"Os Quindins De Yayá\", the title song and \"You Belong To My Heart\" it is a good fun part-live action animated fantasy. It was nominated the Oscars for for Best Music for Edward H. Plumb, Paul J. Smith and Charles Wolcott and Best Sound. Donald Duck was number 50 on The 100 Greatest Cartoons. Worth watching!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Disney's 7th animated feature film combines animation and live action in a movie which purports to be a travelogue of Latin America in which Donald Duck sees the world, makes a couple of feathered friends, and lusts after a variety of comely young human women.", "There are a number of different sequences in the film, some musical and some not and, to be frank, not only do they not all fit well, they aren't all up to Disney's usual standard. The penguin sequence is out of place, and much of the central musical sequence, while highly imaginative, is overlong and lacks the discipline which benefited the later Pink Elephants sequence in Dumbo, for instance. And the animation itself isn't always as good as one would expect.", "And then we have the title song, about three quarters of the way through, in which it all comes gloriously together. Jam packed full of gags, musically full of joy, lyrically clever and witty, and furiously and surrealistically animated, it is a sequence of genius.", "If only the rest of the film had been as good."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["All the fully animated segment of this film are enjoyable and look good, however, the live action segments either go on longer than they should've, or have Donald duck flirting with a live action woman, which is weird."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The Three Caballeros (1945) - 4.8", "Donald Duck gets presents from friends in Latin America", "Filmed during WW2 to bolster relations with South America", "Not much value still in this film as it's just a bunch of segments strung together, no real narrative", "Aves Raras - 4.2", "Learn about penguins coming to South America", "Learn about other birds too", "Boy catches a flying donkey and then races him", "\nBrasil - 5.8", "Meet a green parrot who tells Donald info about Brasil with songs", "Mix animated characters with real life actors in the same scene for the first time", "Very impressive for the time", "Awesome ingenuity", "Mexican bird joins to make the three Caballeros", "\nMexico - 4.5", "Gets a piñata and learn about their Christmas time", "Mexico City built over a lake", "Learn about dances and culture", "Do deal keeps saying toots and it's gross", "More real life stuff mixed in just not very compelling", "Donal goes on an acid trip and fantasizes about pretty girls", "Ends with fireworks"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["The songs and the animation are fun and enjoyable. But the general 'story' is non-sensical and kinda gets forgotten toward the end of the film and everything just sort of becomes a psychedelic-Hispanic mess of color and music."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["This film isn´t for me. But is better than melody time. But is horrible too"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Ever since I was a baby I wanted to see this movie and now I did so, thirty years later, I am profounded disappointed. This is nothing but wat propaganda, like what Leni Riefenstahl did for the Nazis with Triumph Des Willens: only that was interesting, and this was plainly boring. And Donald is one unfaithful horny duck!!!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["It kills me to rate any Disney movie so low, but I can't help it. I understand the history and significance of The Three Caballeros...heck, I have even been on the attraction at WDW no less than 100 times, but I couldn't get into the film. I am not sure I fully understand the movie, other than Donald visits Brazil and Mexico and somehow receives some gifts (throw in a short about a penguin). Donald's character is as like-able in this film as in any other, but the flow of the film didn't work for me. I am sure back in 1945, this film was viewed as being advanced, but it comes off a little weird for 2019. Honestly, the best scene was during the iconic Three Caballeros song, other than that, I was not impressed with the film.", "PS: The attraction makes more sense now....Visit the Mexico Pavilion in EPCOT!"]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Although not the best film ever, I loved it. It has an exciting and very funny story, although it is not the best movie ever. I recommend."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I loved this film when I was little. Donald Duck gets a strange birthday present. At first he watches some films about birds. One of them is about a penguin that can't keep warm while the other is about a flying donkey. Then the film gets so surreal. He opens up a book and is miniaturised to a tiny size and meets a parrot named Joe who gives him a tour of Brazil. Then Donald is horrified to learn he is so small. Joe teaches him a magic chant to make him bigger but he does something wrong and becomes a balloon. Then everything is OK and they open up their last gift which is an odd Mexican rooster. He teaches them about Mexico and then the film gets very odd when Donald is lured by a strange star woman. Suddenly, he's being stomped by cactus monsters. This film is recommended to kids mainly, not to adults. This was my favorite film when I was four."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["\"Saludos Amigos\" (1942) and \"The Three Caballeros\" (1944) are really dreadful Walt Disney productions, which were made during World War II supposedly to improve relations between the United States and Latin American countries. Luckily in \"The Three Caballeros\" the action only takes place in Mexico and Brazil. Of course, there are some attractive things, such as the proto-psychedelic animation of Mary Blair that would flourish in \"Alice in Wonderland\" (Disney's most \"stoned\" feature, if you ask me), but almost by rule all is offensive: stereotypes, ridiculous characters or cultural mockery. All the plot offers is Donald Duck opening presents on his birthday, from two Latin American friends: Brazilian José Carioca (from \"Saludos Amigos\") and Mexican Panchito (Villa, I suppose). Each time a box is open you watch an animated sequence of native songs (including a horrendous English version of maestro Manuel Esperón's \"Ay Jalisco no te rajes\"). Donald Duck (who looks a lot like Donald Trump in his arrogant behavior) even harasses several Latin women, anticipating the days of his namesake. The only thing that seemed fantastic to me (and it's personal taste, of course) was Carmen Miranda's sister, the sinuous Aurora Miranda who sings and dances in a beautiful and colorful musical sequence composed by Ary Barroso. If Disney has kept \"Song of the South\" out of circulation because of \"offensive treatment of African-American\" this film could deserve the same medicine. However, the only thing Disney executives seem to find objectionable is that the characters smoke, so in the DVD edition cigars and cigarettes were deleted, except the one in José Carioca's peak... As \"Saludos Amigos\", it is a schematic, silly and ugly Disney you can ignore."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["So the idea behind making \"The Three Caballeros\" was that Disney was building goodwill with Latin America. I suspect that most of the people in hispanophone and lusophone America who saw it left the theater thinking \"Disney has a weird idea of goodwill.\" Basically, it makes the region look like a nonstop party, always populated by sexy women. The representatives are a pair of exuberant birds: a suave Brazilian parrot and a hyperactive Mexican rooster. A real look at Latin America would focus on colonialism and poverty. To be certain, Brazil bulldozed favelas to make room for the World Cup stadium (which will probably never get used again).", "I know, this movie wasn't really meant to be serious. Even so, pushing stereotypes is not an authentic way to build goodwill."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["That they call this one a \"classic\" is a disgrace to all other real classics...\nAn obvious propaganda film..."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Apart from the wonderful animations and backgrounds, there is no real story to this."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["I'm surprised that the Hays Office Code let Walt Disney get away with inappropriateness in cartoons before 1968, which Disney died two years before that code was eliminated. Imagine! Inter-specie intimacy! In a Disney cartoon! It would have been better off given a PG rating back when it was reissued in 1977 because of the suggestive inter-specie themes. At least this is nowhere as disgusting as the atrocious \"Foodfight!\" (don't get me started on that)."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["Why don't we see more of Jose and Panchita? They are iconic and have good chemistry. Their sequences were all visually entertaining. I can't say I loved the overall film though."]},
{"title": "The Three Caballeros (1944) - IMDb", "text": ["After Saludos Amigos, another short film collection was commissioned, because Disney had forgotten to say anything about Mexico. That's pretty much the reason for this film's existence, but it rises above that.", "For one, the segments are all much stronger than in Saludos Amigos. It's still mainly just an ad campaign for South America, but I like that they have a framing story where Donald is celebrating his birthday and gets a present from his South American friends. José is also back, and we get another new great character, Panchito Pistoles, a Mexican rooster. And yes, the name is kind of awful, but the character itself is a lot of fun.", "The first two segments, The Cold-Blooded Penguin and The Flying Gauchito, are both very good. The comedy is mostly silent and/or physical, the characters are sympathetic and the animation is very nice. There's also a piece about Aracuan Bird, one of the worst earworms in existence. You have been warned.", "The few following segments, Baía, Mexico: Pátzcuaro, Veracruz and Acapulco and You Belong To My Heart are merely more gallivanting around like in Saludos Amigos. They're fun to watch in their own way, the music is very nice, but they drag on for a bit too long and nothing much happens in them.", "Though at least we get the piñata scene and Las Posadas, which are some of my favourite short segments Disney has ever done. Great mood, great atmosphere, flawless animation and all around enjoyment.", "And then we have Donald's Surreal Reverie, which is probably the reason you should see this film. Think Pink Elephants on Parade, but much, much longer and ever crazier. I swear the animators were under some sort of influence, they had to be. It's a mind trip unlike anything Disney has ever produced. And yeah, it's a truckload of fun to watch, not gonna lie.", "The Three Caballeros is still not what I would call a good film. It is better than Saludos Amigos, if only because it's so weird that you cannot help but be intrigued by it. Definitely worth a watch, though, especially if you want to say you've seen them all."]}
]